Repository: glixx/tkgate
Catalog: locale/*/manuals_*.po
Languages: de, ru

source: <h3>Editing Gates</h3> <b>(Adding Inputs)</b> Some gates (e.g., AND gates) can have a variable number of inputs or outputs. To add inputs (or outputs) to these gates, select the gate and press the <img src=addport.gif bgcolor=gray> button. Also, some gates may have multiple styles for adding ports that can be selected through the gate properties box. Try adding inputs to the gates below, or create a new gate and add inputs to it.
de: <h3>Editieren von Gattern</h3> <b>(Eingänge hinzufügen)</b> Einige Gatter (AND Gatter z.B.) können eine variable Anzahl von Eingängen oder Ausgängen haben. Um diesen Gattern Eingänge oder AusgÄnge hinzuzufügen, wählt man das Gatter aus und drückt den <img src=addport.gif bgcolor=gray> Knopf. Einige Gatter können auch verschiedene Methoden zum Hinzufügen von Ports bieten, die dann in der Eigenschaftsbox des Gatters angeboten werden. Versuche, zu den Gattern unten Eingänge hinzuzufügen oder erzeuge ein neues Gatter und versieh es mit zusätzlichen Eingängen.
ru: <h3>Редактирование вентилей</h3> <b>(Добавление вентилей)</b> Некоторые вентили (например И) могут иметь переменное число входов и выходов. Для добавления входов (или выходов) к такому вентилю, выделите его и нажмите кнопку <img src=addport.gif bgcolor=gray>. Кроме того, многие вентили имеют различные стили добавления и отображения портов, доступные из диалога свойств вентиля. Попробуйте изменить число портов у вентилей внизу, а также у вновь создаваемых вентилей.

source: <h3>Editing Gates</h3> <b>(Anchoring)</b> You can prevent a gate from being accidentally moved by selecting it and pressing the <img src=anchor.gif bgcolor=gray> button to set an anchor. You can remove an anchor with the <img src=unanchor.gif bgcolor=gray> button. Gates which have been anchored (e.g., the OR gate below) can not be moved until you remove the anchor. Try moving the gates below.
de: <h3>Editieren von Gattern</h3> <b>(Verankerung)</b> Um zu verhindern, daß ein Gatter aus Versehen bewegt wird, kann man es auswählen und den <img src=anchor.gif bgcolor=gray> Knopf drücken, um einen Anker zu setzen. Er kann mit dem <img src=unanchor.gif bgcolor=gray> Knopf wieder entfernt werden. Festgezurrte Gatter, wie das OR Gatter unten, können nicht bewegt werden, solange der Anker nicht entfernt ist. Versuche die Gatter unten zu bewegen.
ru: <h3>Редактирование вентилей</h3> <b>(Привязка)</b> Предотвратить случайное изменение положения вентиля можно, используя кнопку <img src=anchor.gif bgcolor=gray> для установления привязки. Кнопкой <img src=unanchor.gif bgcolor=gray> удалить привязку. Привязанные вентили (например, вентиль или внизу) не могут быть перемещены, пока Вы не удалите привязку. Попробуйте переместить вентили внизу.

source: <h3>Editing Gates</h3> <b>(Comments and Frames)</b> There are two special "gates" that you can use for annotating your circuit specification: comments and frames. Neither of these "gates" has any effect on the simulation results. Comments are blocks of text such as those used to construct this tutorial. Comments are created by right clicking and selecting <font color=red2>Make &rarr; Comment</font> from the popup menu. When you create a comment, the properties box will appear immediately allowing you to enter the text of the comment. Comments can contain limited html tags including links to other circuit files, or short cuts to specific gates in your circuit. Frames are annotated boxes for organzing groups of related circuit elements that don't warrant creating a new module. Open the properties box by double clicking on an edge to set the annotation string. Click and drag on a corner to resize.
de: <h3>Editieren von Gattern</h3> <b>(Kommentare und Rahmen)</b> Es gibt zwei spezielle "Gatter", die man zur Beschriftung der Schaltung nutzen kann: Kommentare und Rahmen. Keines dieser "Gatter" hat irgendeinen Effekt auf die Simulationsergebnisse. Kommentare sind Textblöcke wie die, mit denen dieser Lehrgang erzeugt ist. Kommentare werden durch Rechtsklick und Auswahl von <font color=red2>Bausteine &rarr; Kommentar</font> aus dem Popup Menu erzeugt. Wird ein Kommentar erzeugt, so erscheint die Eigenschaftsbox sofort und erlaubt, den Text des Kommentars einzugeben. Kommentare können eine begrenzte Zahl von HTML-Tags einschließlich Links zu anderen Schaltungsdateien enthalten, oder Kurzschlußzugänge zu bestimmten Gattern der aktuellen Schaltung. Rahmen sind benannte Boxen, mit denen Gruppen zusammengehöriger Schaltungselemente zusammengefaßt werden können, wenn sich die Erzeugung eines eigenen Moduls dafür nicht lohnt. Öffne die Eigenschaftsbox durch Doppelklick auf eine Kante und gib die Zeichenkette zur Beschreibung ein. Verändere die Größe durch Klicken und Ziehen an einer Ecke.
ru: <h3>Редактирование вентилей</h3> <b>(Комментарии и рамки)</b> Существует два специальных вида "вентилей", которые можно использовать для описания Ваших схем: комментарии и рамки. Ни один из этих "вентилей" не оказывает влияния на результаты симуляции. Комментарии - это блоки гипертекста, такие как те, из которых составлено данное руководство. Чтобы создать комментарий нажмите правой кнопкой мыши на схеме и выберите <font color=red2>Компоненты &rarr; Комментарий</font> из меню. Когда Вы создаете комментарий, сразу же появляется диалог свойств, позволяющий ввести текст. Комментарии могут содержать ограниченный набор html тэгов, включая ссылки на другие файлы схем или определённые части текущей схемы. Рамки позволяют логически группировать связанные наборы вентилей без необходимости создавать модуль. Дважды щёлкните по ребру рамки, чтобы открыть диалог свойств и выбрать текст подписи. Щёлкните и перетащите угол рамки для изменения размера.

source: <h3>Editing Gates</h3> <b>(Deletion)</b> To delete a gate, select it with the <img src="mov_curs.gif" bgcolor=gray> tool and press the <font color=red2>Delete</font> key. Try it on the sample circuit below.
de: <h3>Editieren von Gattern</h3> <b>(Löschen)</b> Um ein Gatter zu löschen, wird es mit dem <img src="mov_curs.gif" bgcolor=gray> Werkzeug ausgewählt und die <font color=red2>Entf</font> Taste gedrückt. Versuche das bei der Beispielschaltung unten.
ru: <h3>Редактирование вентилей</h3> <b>(Удаление)</b> Для удаления вентиля щёлкните его инструментом <img src="mov_curs.gif" bgcolor=gray> и нажмите клавишу <font color=red2>Delete</font>. Попробуйте на схеме внизу.

source: <h3>Editing Gates</h3> <b>(Properties)</b> You can also open the properties box of a gate by double clicking on it. Try double clicking on some of the gates in the circuit below. Through the properties box you can change the label of a gate and make the label visible or invisible though the "Hide Name" property.
de: <h3>Editieren von Gattern</h3> <b>(Eigenschaften)</b> Die Eigenschaftsbox eines Gatters öffnet man durch Doppelklick darauf. Versuche das bei einigen Gattern der untenstehenden Schaltung. In der Eigensschaftsbox kann die Bezeichnng eines Gatters geändert werden. Sie kann auch durch die "Namen verbergen"-Eigenschaft sichtbar oder unsichtbar gemacht werden.
ru: <h3>Редактирование вентилей</h3> <b>(Свойства)</b> Диалог редактирования свойств вентиля можно вызвать, выбрав пункт <b>Свойства экземпляра</b> контекстного меню, вызываемого щелчком правой кнопки мыши на вентиле. Также этот диалог можно открыть дважды щёлкнув на вентиле. Используя данный диалог, попробуйте изменить подписи под вентилями на схеме и изменить их режим отображения/сокрытия.

source: <h3>Editing Gates</h3> <b>(Repositioning)</b> To move a gate, select it with the <img src="mov_curs.gif" bgcolor=gray> tool and drag it to a new location. Try it on the sample circuit below.
de: <h3>Editieren von Gattern</h3> <b>(Verschieben)</b> um ein Gatter zu bewegen, wähle es mit <img src="mov_curs.gif" bgcolor=gray> aus und ziehe es an den neuen Ort. Versuche es mit der Beispielschaltung unten.
ru: <h3>Редактирование вентилей</h3> <b>(Перемещение)</b> Для перемещения вентиля захватите его инструментом <img src="mov_curs.gif" bgcolor=gray> и переместите его в новую позицию. Потренируйтесь на схеме снизу.

source: <h3>Editing Gates</h3> <b>(Rotation)</b> The orientation of a gate can be changed by selecting it and pressing the <img src="edit_rotate.gif" bgcolor=gray> button (or <font color=red2>Tab</font> key) to rotate it counter-clockwise and the <img src="edit_brotate.gif" bgcolor=gray> button (or <font color=red2>Shift-Tab</font> key) to rotate it clockwise. Try it on the AND gate below.
de: <h3>Editieren von Gattern</h3> <b>(Drehungen)</b> Die Ausrichtung eines Gatters kann geändert werden, indem man das Gatter auswählt und den <img src="edit_rotate.gif" bgcolor=gray> Knopf (oder die <font color=red2>Tab</font> Taste) drückt, um es gegen den Uhrzeigersinn zu drehen. Den <img src="edit_brotate.gif" bgcolor=gray> Knopf (oder die <font color=red2>Shift-Tab</font> Tastenkombination) nimmt man, um im Uhrzeigersinn zu drehen. Versuche das mit dem AND Gatter unten.
ru: <h3>Редактирование вентилей</h3> <b>(Поворот)</b> Ориентацию вентиля можно изменить, выбрав его и нажав кнопку <img src="edit_rotate.gif" bgcolor=gray> (или клавишу <font color=red2>Tab</font>), для того, чтобы повернуть его против часовой стрелки, и кнопку <img src="edit_brotate.gif" bgcolor=gray> (или клавиши <font color=red2>Shift-Tab</font>) для вращения по часовой стрелке. Потренируйтесь на вентиле И внизу.

source: <h3>Editing Gates</h3> This chapter will introduce some of the basic circuit editing features of TkGate.
de: <h3>Editieren von Gattern</h3> Dieser Abschnitt führt in einige grundlegende Editierfunktionen von TkGate für Gatter ein.
ru: <h3>Редактирование вентилей</h3> В этом разделе рассматриваются некоторые средства редактирования схем в TkGate.

source: <h3>Editing Wires</h3> <b>(bit widths)</b> To change the bit size of one or more wires, first enter the desired bit size in the bit size selector <img src="size_example.gif">. Next, choose the <img src="size_curs.gif" bgcolor=gray> tool, and click on each wire to be changed to that size. Try changing the 8-bit wires in the circuit below to 16-bit wires.
de: <h3>Leitungen editieren</h3> <b>(Bitbreiten)</b> Um die Bitbreite einer oder mehrerer Leitungen zu ändern, muß zuerst die gewünschte Bitbreite in der Bitbreiten-Auswahl <img src="size_example.gif"> eingegeben werden. Dann wähle das <img src="size_curs.gif" bgcolor=gray> Werkzeug und klicke auf jede Leitung, deren Breite geändert werden soll. Versuche in der Schaltung unten die 8-Bit-Leitungen in 16 Bit Breite zu ändern.
ru: <h3>Редактирование проводников</h3> <b>(разрядность)</b> Чтобы изменить разрядность одного или нескольких проводников, сначала введите требуемое значение в поле <img src="size_example.gif">, после чего выберите инструмент <img src="size_curs.gif" bgcolor=gray> и щёлкните по нужному проводнику. Попробуйте изменить 8-ми разрядные проводники на схеме внизу на 16-ти разрядные.

source: <h3>Editing Wires</h3> <b>(cutting)</b> To cut a wire, select the <img src="cut_curs.gif" bgcolor=gray> tool and click on a wire at the point you wish to cut. Try using the wire cutter tool to cut some of the wires in the circuit below.
de: <h3>Leitungen editieren</h3> <b>(Trennen)</b> Zum Durchtrennen von Leitungen wähle das <img src="cut_curs.gif" bgcolor=gray> Werkzeug und klicke auf eine Leitung an der Trennstelle. Probiere das Trennwerkzeug an einigen Leitungen in der untenstehenden Schaltung aus.
ru: <h3>Редактирование проводников</h3> <b>(разрезание)</b> Для разрезания проводника выберите инструмент <img src="cut_curs.gif" bgcolor=gray> и щёлкните по проводнику в месте разреза. Попробуйте использовать инструмент разрезания на схеме внизу.

source: <h3>Editing Wires</h3> <b>(I/O inverters)</b> To place or remove an inverter on a gate input or output, select the <img src="inv_curs.gif" bgcolor=gray> tool and click on the port at which you want to place or remove an inveter. Try using the inverter tool to place and remove inverters in the circuit below.
de: <h3>Leitungen editieren</h3> <b>(I/O Inverter)</b> Wähle das <img src="inv_curs.gif" bgcolor=gray> Werkzeug, um einen Inverter an einen Gatterein- oder ausgang zu setzen oder dort zu löschen. Klicke auf einen Port, an dem ein Inverter gesetzt oder gelöscht werden soll und versuche mit dem Inverterwerkzeug in der Schaltung unten Negationen zu setzen oder zu löschen.
ru: <h3>Редактирование проводников</h3> <b>(Инверсия входов/выходов)</b> Чтобы добавить или убрать инвертор на входе или выходе вентиля выберите инструмент <img src="inv_curs.gif" bgcolor=gray> и щёлкните на порте. Потренируйтесь в использования инструмента инверсии входов/выходов на схеме внизу.

source: <h3>Editing Wires</h3> <b>(wire labels)</b> Wire label editing is performed with the <img src=mov_curs.gif bgcolor=gray> tool. Select this tool if it is not already selected. Existing wire labels can be moved by left clicking and dragging the label to a new position. Wire labels can only be moved to a different locations on the wire from which it was grabbed. If you drop the label too far from its wire, the label will be discarded. To display a new label right click on the wire and choose the <font color=red2>Show Label</font> option. You can also hide a specific label (<font color=red2>Hide Label</font>) or hide all labels for a wire (<font color=red2>Hide All Labels</font>).
de: <h3>Leitungen editieren</h3> <b>(Leitungsmarkierungen)</b> Mit dem <img src=mov_curs.gif bgcolor=gray> Werkzeug kann man Bezeichnungen an Leitungen anbringen. Aktiviere dieses Werkzeug, falls es noch nicht aktuell ausgewählt ist. Bereits existierende Namen können durch Linksklick mit Ziehen neu positioniert werden. Allerdings kann der Name nur in der Nähe der assoziiierten Leitung verschoben werden. Wird die Markierung zu weit wegbewegt, kann sie verlorengehen. Um einen neuen Namen zu vergeben, wählt man nach Rechtsklick auf die Leitung die <font color=red2>Namen anzeigen</font> Option. Sie können auch eine bestimmte Beschriftung ausblenden (<font color=red2>Beschriftung ausblenden</font>) oder alle Beschriftungen für einen Draht ausblenden (<font color=red2>Alle Beschriftungen ausblenden</font>).
ru: <h3>Редактирование проводников</h3> <b>(Надписи)</b> Редактирование надписей на проводниках производится с помощью инструмента <img src=mov_curs.gif bgcolor=gray>. Выберите этот инструмент, если он ещё не выбран. Существующие надписи могут быть перемещены простым перетаскиванием на новое место. Надписи могут быть перемещены только вдоль своего проводника. Если отпустить надпись далеко от проводника, то изменение будет отклонено. Чтобы отобразить надпись выберите <font color=red2>Показать надпись</font> из контекстного меню. Скрыть одну надпись проводника можно выбрав <font color=red2>Скрыть надпись</font>, а скрыть все - выбрав <font color=red2>Скрыть все надписи</font>.

source: <h3>Editing Wires</h3> This chapter will introduce the basic wire editing features of TkGate.
de: <h3>Leitungen editieren</h3> Dieser Abschnitt führt in die grundlegenden Möglichkeiten ein, Leitungen zu editieren.
ru: <h3>Редактирование проводников</h3> Этот раздел ознакомит Вас с основными функциями TkGate по редактированию проводников в схемах.

source: <h3>Group Editing Features</h3> <b>(clipboard operations)</b> You can use Cut and Paste operations to cut or copy a group of gates to the clipboard and paste it somewhere else. Select a group of gates then press the <img src=edit_cut.gif bgcolor=gray> or <img src=edit_copy.gif bgcolor=gray> buttons to cut or copy, respectively, the selected gates to the clipboard. To paste the contents of the clipboard, first set a <img src=mark.gif> with the left mouse button, then press the <img src=edit_paste.gif bgcolor=gray> button to paste the clipboard contents to that location.
de: <h3>Editieren von Bausteingruppen</h3> <b>(Zwischenablagefunktionen)</b> Die Zwischenablage kann für das Ausschneiden oder Kopieren einer Gattergruppe genutzt werden, um sie nachher woanders wieder einzufügen. Wähle eine Gruppe von Gattern aus klicke dann auf die <img src=edit_cut.gif bgcolor=gray> oder <img src=edit_copy.gif bgcolor=gray> Knöpfe, um sie in die Zwischenablage auszuschneiden oder zu kopieren. Zum Einfügen des Inhalts der Zwischenablage setzt man erst mit einem Linksklick ein <img src=mark.gif>, dann drückt man den <img src=edit_paste.gif bgcolor=gray> Knopf und der Inhalt der Zwischenablage erscheint an dieser Stelle.
ru: <h3>Средства редактирования групп</h3> <b>(операции с буфером обмена)</b> Вы можете использовать операции копирования и вырезания групп вентилей в буфер обмена с тем, чтобы вставить их где-нибудь в другом месте. Выделите группу вентилей, затем нажмите кнопку <img src=edit_cut.gif bgcolor=gray> для вырезания или <img src=edit_copy.gif bgcolor=gray> для копирования выделенных вентилей в буфер обмена. Для вставки содержимого буфера сначала установите курсор <img src=mark.gif> в нужную позицию с помощью левой кнопки мыши, затем нажмите кнопку <img src=edit_paste.gif bgcolor=gray> для вставки содержимого в данную позицию.

source: <h3>Group Editing Features</h3> <b>(incremental selection)</b> You can add or remove gates from the current selection by holding the <font color=red2>Control</font> key while you click on them.
de: <h3>Editieren von Bausteingruppen</h3> <b>(inkrementelle Auswahl)</b> Es ist möglich, zur aktuellen Auswahl Gatter hinzuzufügen oder zu entfernen. Dazu hält man die <font color=red2>Strg</font> Taste gedrückt, während auf das Gatter geklickt wird.
ru: <h3>Средства редактирования групп</h3> <b>(инкрементное выделение)</b> Можно добавлять или удалять вентили к текущей выделенной группе, удерживая клавишу <font color=red2>Control</font> во время выделения вентилей.

source: <h3>Group Editing Features</h3> <b>(rotation and anchoring)</b> You can rotate (with <img src=edit_rotate.gif bgcolor=gray> and <img src=edit_brotate.gif bgcolor=gray>) and anchor (with <img src=anchor.gif bgcolor=gray> and <img src=unanchor.gif bgcolor=gray>) a group of gates in the same way as you did for single gates in the <a href=gates.v>Editing Gates</a> chapter. Try it on the circuit below.
de: <h3>Editieren von Bausteingruppen</h3> <b>(Drehen und Verankern)</b> Eine Bausteingruppe kann (mit <img src=edit_rotate.gif bgcolor=gray> und <img src=edit_brotate.gif bgcolor=gray>) gedreht und (mit <img src=anchor.gif bgcolor=gray> und <img src=unanchor.gif bgcolor=gray>) verankert werden, und das genauso, wie es im Abschnitt <a href=gates.v>Gatter editieren</a> für einzelne Gatter geschah. Versuche es mit der Schaltung unten.
ru: <h3>Средства редактирования групп</h3> <b>(вращение и привязка)</b> Вы можете поворачивать (при помощи <img src=edit_rotate.gif bgcolor=gray> и <img src=edit_brotate.gif bgcolor=gray>) и привязывать (при помощи <img src=anchor.gif bgcolor=gray> и <img src=unanchor.gif bgcolor=gray>) группы точно также, как и отдельные вентили (см. <a href=gates.v>Редактирование вентилей</a> раздел). Попробуйте на схеме снизу.

source: <h3>Group Editing Features</h3> <b>(selection and movement)</b> To select a group of gates, press and hold the left mouse button above and to the left of the group, then drag the cursor diagonally accross the group to open the selection box. Release the mouse when the selection box includes all of the gates you wish to select. Drag any selected gate to move the entire group. Try it on the circuit below.
de: <h3>Editieren von Bausteingruppen</h3> <b>(Auswahl und Bewegung)</b> Eine Gruppe von Gattern wird ausgewählt, indem die linke Maustaste links oberhalb der Gatter gedrückt und festgehalten wird und dann der Mauszeiger diagonal nach rechts unten gezogen wird, um die Auswahlbox zu öffnen. Man gibt die Maus frei, wenn alle gewünschten Gatter sich innerhalb der Box befinden. Jetzt kann die Gruppe an einem beliebigen Gatter angefaßt und bewegt werden. Versuche das bei der Schaltung unten.
ru: <h3>Средства редактирования групп</h3> <b>(выделение и перемещение)</b> Чтобы выделить группу вентилей, нажмите и удерживайте левую кнопку мыши выше и левее группы, затем перемещайте курсор ниже и правее, чтобы завершить выделение. Отпустите кнопку мыши, когда рамка выделения охватит все необходимые вентили. Перемещайте любой вентиль в группе, чтобы переместить всю группу. Попробуйте на схеме внизу.

source: <h3>Group Editing Features</h3> In this chapter, you will learn about how to do editing operations on groups of gates.
de: <h3>Editieren von Bausteingruppen</h3> In diesem Abschnitt lernen wir, wie Gruppen von Gattern gemeinsam editiert werden können.
ru: <h3>Средства редактирования групп</h3> В данном разделе рассматриваются операции по редактированию групп вентилей в TkGate.

source: <h3>Sequential Simulation</h3> <b>(breakpoints)</b> You can use breakpoints to simulate a circuit until some condition holds. To add a breakpoint click on the <img src=sim_break.gif bgcolor=gray> tab on the information box below the canvas, and press the <font color=red2>Add...</font> button. Enter the breakpoint as a Verilog expression. Start the simulator and try it with the expresion "reg_out == 8'h42" as shown in the example on the right. This will cause the simulator to stop when the reg_out signal has the value 42 hexidecimal. Be sure to press <img src=sim_go.gif bgcolor=gray> after entering the breakpoint.
de: <h3>Simulation von Schaltwerken</h3> <b>(Haltepunkte)</b> Haltepunkte können verwendet werden, um eine Schaltung so lange zu simulieren, bis eine Bedingung erfüllt ist. Um einen Haltepunkt zu setzen klicke auf die <img src=sim_break.gif bgcolor=gray> Taste auf der Informationsbox unterhalb der Arbeitsfläche und drücke den <font color=red2>Hinzufügen...</font> Knopf. Gib den Haltepunkt als Verilog-Ausdruck an. Starte den Simulator und versuche es mit dem Ausdruck "reg_out == 8'h42" wie im Beispiel auf der rechten Seite. Das führt zum Halt des Simulators, wenn das reg_out Signal den hexadezimalen Wert 42 hat. Vergiß nicht, nach der Eingabe des Haltepunkts <img src=sim_go.gif bgcolor=gray> zu drücken.
ru: <h3>Симуляция последовательных схем</h3> <b>(точки остановки)</b> Точки остановки позволяют продолжать симуляцию до выполнения некоторого условия. Чтобы добавить точку остановки выберите вкладку <img src=sim_break.gif bgcolor=gray> в информационном блоке снизу от области редактирования и нажмите кнопку <font color=red2>Добавить...</font>. Введите точку остановки, как выражение <b>Verilog</b>. Запустите симулятор и попробуйте выражение <b>reg_out == 8'h42</b> как показано на рисунке справа. Это вызовет остановку симулятора, как только сигнал <b>reg_out</b> получит значение 42 (16-ричное). Не забудьте снова нажать кнопку <img src=sim_go.gif bgcolor=gray> после достижения точки остановки.
