Repository: glixx/tkgate
Catalog: locale/*/manuals_*.po
Languages: de, ru

source: <h3>Wire Editing</h3> <b>(Gravity)</b> Click on the wire indicated by the arrow in the circuit below and drag it until it is nearly alligned with the other vertical segment. When you release the wire, "gravity" will cause the two vertical segments to snap together into a single segment.
de: <h3>Leitungen editieren</h3> <b>(Anziehungskraft)</b> Klicke in der Schaltung unten auf die Leitung an der Stelle mit dem Pfeil und ziehe sie solange nach links bis sie mit dem anderen vertikalen Element nahezu auf Linie ist. Wird die Leitung losgelassen, führt "Anziehungskraft" dazu, daß die beiden vertikalen Segmente zu einem einzigen Segment einrasten.
ru: <h3>Расширенные техники редактирования</h3> <b>(Редактирование проводников: гравитация)</b> Перетаскивайте фрагмент проводника, отмеченный на схеме стрелкой, пока он почти не выровняется с остальной вертикальной частью. Когда вы его отпустите, "гравитация" заставит оба фрагмента.

source: <h3>Wire Editing</h3> <b>(Joint Creation)</b> Now try the same thing again, but this time drop the inverter input closer to the AND gate output away from the joint. This time a new joint is automatically created.
de: <h3>Leitungen editieren</h3> <b>(Erzeugen von Lötstellen)</b> Nun noch einmal das gleiche, diesmal aber lasse das Invertereingangssegment näher am AND-Ausgang los, weg von der Lötstelle. Diesmal wird eine neue Lötstelle automatischerzeugt.
ru: <h3>Редактирование проводников</h3> <b>(Создание соединений)</b> Проделайте то же самое, но на сей раз отпустите конец проводника ближе к выходу вентиля <b>И</b>. В этом случае будет создано новое соединение.

source: <h3>Wire Editing</h3> <b>(Joint Creation)</b> Select the <img src="mov_curs.gif" bgcolor=gray> tool and drag the input of the inverter in the circuit below. Drag the input close to the joint in the middle of the AND gate output and release it. The wire should attach itself to the joint.
de: <h3>Leitungen editieren</h3> <b>(Erzeugen von Lötstellen)</b> Wähle das <img src="mov_curs.gif" bgcolor=gray> Werkzeug und ziehe den Eingang des Inverters in der Schaltung unten nahe an die Lötstelle in der Mitte des AND-Gatterausgangssegments und lasse los. Die Leitung sollte sich von selbst mit der Lötstelle verbinden.
ru: <h3>Расширенные техники редактирования</h3> <b>(Редактирование проводников: создание соединений)</b> Выберите инструмент <img src="mov_curs.gif" bgcolor=gray> и захватите проводник на входе свободного инвертера. Перетащите его как можно ближе к точке соединения входов двух других инвертеров. Проводник будет включен в соединение.

source: <h3>Wire Editing</h3> <b>(Rerouting)</b> TkGate will automatically reroute wires that do not leave a gate or joint on the correct direction. Try grabbing the wire indicated by the arrow in the two examples below and drag them to the left. In the XOR gate example, two new wire segments are added. In the joint example, one new segment is added, and the position on the joint is adjusted.
de: <h3>Leitungen editieren</h3> <b>(Neuverbinden)</b> TkGate verbindet automatisch Leitungen neu, die ein Gatter oder eine Lötstelle nicht in die richtige Richtung verlassen. Versuche in den beiden Beispielen unten, die Leitung an der Pfeilstelle anzufassen und nach links zu ziehen. Im XOR-Beispiel werden zwei neue Leitungssegmente hinzugefügt. Im Lötstellenbeispiel wird ein Segment hinzugefügt und die Verbindungsstelle angepaßt.
ru: <h3>Редактирование проводников</h3> <b>(Маршрутизация)</b> TkGate автоматически маршрутизирует проводники, которые выходят из компонента в неверном направлении. Попробуйте перетащить проводники на схеме в позиции и направлении, отмеченных стрелками. В примере с вентилем <b>ИСКЛ. ИЛИ</b> будут добавлены два новых сегмента. В примере с соединением добавится один сегмент, и будет назначена позиция соединения.

source: <h3>Wire Editing</h3> <b>(Search)</b> You can search your circuit for a wire or gate with a specific name by using the search tool. Click on the <img src=edit_find.gif bgcolor=gray> tool to open it. The list of matches will by dynamically updated as you type the target string. Double click on an entry in the <font color=red2>Search Results</font> to go to that object. Try using the search tool to search for some of the wire and gate names in the circuit below.
de: <h3>Leitungen editieren</h3> <b>(Suchen)</b> In der ganzen Schaltung kann mit einem Namen nach einer bestimmten Leitung oder einem bestimmten Gatter mit dem Suchwerkzeug gesucht werden. Klicke zum Öffnen auf das <img src=edit_find.gif bgcolor=gray> Werkzeug. Die Liste der Treffer wird dynamisch angepaßt, während der Suchstring getippt wird. Mit einem Doppelklick auf einen Eintrag in den <font color=red2>Suchergebnissen</font> gelangt man zu diesem Objekt. Probiere das Suchwerkzeug für einige der Leitungen und Gatter in der untenstehenden Schaltung aus.
ru: <h3>Расширенные техники редактирования</h3> <b>(Поиск)</b> Инструмент <b>Поиск</b> позволяет находить проводники или компоненты в схеме по имени. Нажмите кнопку <img src=edit_find.gif bgcolor=gray> чтобы воспользоваться поиском. В процессе ввода текста список соответствующих компонентов будет автоматически обновляться. Дважды щёлкните по строке компонента в группе <font color=red2>Результаты поиска</font> чтобы перейти к объекту. Попробуйте найти с помощью данного инструмента некоторые проводники и компоненты на схеме внизу.

source: <h3>Wire Editing</h3> <b>(Wire Segments)</b> Sometime there may not be a free end of two wires you want to connect. Right click on the wire connected to the AND gate output at the position indicated by the arrow. Select the <font color=red2>Add Wire Segment</font> option from the popup menu. You can now connect the newly created wire to the buffer inputs.
de: <h3>Leitungen editieren</h3> <b>(Leitungssegmente)</b> Manchmal gibt es keine freien Enden von zwei Leitungen, die verbunden werden sollen. Klicke mit rechts auf den mit dem AND-Gatter verbundenen Ausgang an der durch den Pfeil angezeigten Stelle. Wähle die <font color=red2>Leitungssegment hinzufügen</font> Option aus dem Popup Menu. Jetzt kann die neu erzeugte Leitung zu den Puffereingängen hinzugefügt werden.
ru: <h3>Редактирование проводников</h3> <b>(Сегменты проводника)</b> Иногда у двух проводников, которые необходимо соединить, может не быть свободных концов. Щёлкните правой кнопкой мыши в позиции, отмеченной стрелкой. Выберите пункт контекстного меню <font color=red2>Добавить сегмент провода</font>. Теперь можно соединить появившийся сегмент со входами буферов.

source: <img src=breakp_example.gif> <b>Breakpoint Entry Example.</b>
de: <img src=breakp_example.gif> <b>Beispiel zur Haltepunkteingabe.</b>
ru: <img src=breakp_example.gif> <b>Пример ввода точки остановки.</b>

source: <img src=chip.gif> Library module. <img src=parts.gif> Container for all libraries. <img src=ichipdir.gif> Container for a single library. <img src=unknown.gif> Use of an undefined module. <img src=conflict.gif> Recursive inclusion of a module.
de: <img src=chip.gif> Bibliotheksmodul. <img src=parts.gif> Behälter für alle Bibliotheken. <img src=ichipdir.gif> Behälter für eine einzige Bibliothek. <img src=unknown.gif> Benutzung eines undefinierten Moduls. <img src=conflict.gif> Rekursive Einbindung eines Moduls.
ru: <img src=chip.gif> Библиотечный модуль. <img src=parts.gif> Контейнер для всех библиотек. <img src=ichipdir.gif> Контейнер для одной библиотеки. <img src=unknown.gif> Использование неопределённого модуля. <img src=conflict.gif> Рекурсивное включение модуля.

source: <img src=document.gif> Top-level or root module. <img src=mod_net.gif> Netlist module. <img src=mod_hdl.gif> Verilog HDL module. <img src=mod_netL.gif> Locked netlist module. <img src=mod_hdlL.gif> Locked Verilog HDL module. <img src=unused.gif> Container for unused modules.
de: <img src=document.gif> Oberstes oder Wurzelmodul. <img src=mod_net.gif> Netzlistenmodul. <img src=mod_hdl.gif> Verilog HDL Modul. <img src=mod_netL.gif> Verriegeltes Netzlistenmodul. <img src=mod_hdlL.gif> Verriegeltes Verilog HDL Modul. <img src=unused.gif> Behälter für unbenutzte Module.
ru: <img src=document.gif> Корневой или модуль верхнего уровня. <img src=mod_net.gif> Модуль в виде графического набора сетей. <img src=mod_hdl.gif> Verilog модуль. <img src=mod_netL.gif> Заблокированный модуль набор сетей. <img src=mod_hdlL.gif> Заблокированный Verilog модуль. <img src=unused.gif> Контейнер неиспользуемых модулей.

source: Logical (M=1) 00 - NOT <b>A</b> 01 - <b>A</b> NOR <b>B</b> 02 - NOT <b>A</b> AND <b>B</b> 05 - NOT <b>B</b> 06 - <b>A</b> XOR <b>B</b> 09 - <b>A</b> XNOR <b>B</b> 0B - <b>A</b> AND <b>B</b> 0E - <b>A</b> OR <b>B</b>
ru: Логические (M=1) 00 - НЕ <b>A</b> 01 - <b>A</b> НЕ-ИЛИ <b>B</b> 02 - НЕ <b>A</b> И <b>B</b> 05 - НЕ <b>B</b> 06 - <b>A</b> ИСКЛ. ИЛИ <b>B</b> 09 - <b>A</b> НЕ-ИСКЛ. ИЛИ <b>B</b> 0B - <b>A</b> И <b>B</b> 0E - <b>A</b> ИЛИ <b>B</b>

source: Main Memory
de: Hauptspeicher
ru: Основная память

source: MDR Control
de: MDR Steuerung
ru: Управление MDR

source: Microcode Next Address Generation
de: Mikrocode Erzeugung der nächsten Adresse
ru: Генерация следующего адреса микрооперации

source: Microinstruction Decode
de: Mikrobefehl decodieren
ru: Декодирование микроопераций

source: OR Gate Circuit
de: OR-Gatterschaltung
ru: Схема с вентилем ИЛИ

source: OR gate
de: OR Gatter
ru: Вентиль ИЛИ

source: <p>Move switcher in logical 1 state to run counter</p>
ru: <p>Переместите переключатель в положение логической единицы, чтобы запустить счётчик</p>

source: Q Register Handling
de: Q Registerbehandlung
ru: Управление регистром Q

source: Register R0 is hard-coded to always be set to 0.
de: Register R0 ist immer auf 0 gesetzt.
ru: Регистр R0 жёстко закодирован и всегда устанавливается в 0.

source: Sequential Simulation
ru: Последовательная симуляция

source: Standard Logic Microcircuits
ru: Микросхемы стандартной логики

source: Switches
de: Schalter
ru: Переключатели

source: Textual Verilog
ru: Текстовый Verilog

source: The IR and OPR registers store the instruction and operand bytes of the current instruction.
de: Die IR und OPR Register verwalten die Instruktions- und Operanden-Bytes der aktuellen Instruktion.
ru: Регистры IR и OPR хранят инструкцию и байт операнда для текущей операции.

source: The module to the left is an interface to a "coke" machine. If you switch to simulation mode and press the simulation "play" button, a window showing an external and internal view of the coke machine will be displayed. You can then drag coins and bills to the coin slot or bill reader, press the drink buttons or press the coin return lever. These actions will cause signals to be sent to your circuit. Inputs to the controller can be used to illuminate lights and/or dispense drinks and change. Problems: 1) Design a controler to control the coke machine via the interface above. 2) Modify your design so that either of the two "Coke" buttons can always be used when there is any Coke in the machine.
de: Das Modul links ist die Schnittstelle zu einem "Cola"-Automaten. Wenn Du in den Simulationsmodus umschaltest und den "Abspielen" Knopf drückst, wird ein Fenster angezeigt, das eine externe und eine interne Sicht des Cola-Automaten aufzeigt. Du kannst dann Münzen einwerfen und Banknoten in den Schlitz ziehen, drücke die Getränkeknöpfe oder die Geldrückgabe. Diese Aktionen erzeugen Signale, die an Deine Schaltung gesendet werden. Eingänge der Steuerung können zur Beleuchtung und/oder für den Getränkespender oder das Wechselgeld benutzt werden. Aufgaben: 1) Entwirf eine Steuerung für den obigen Cola-Automaten mit der gegebenen Schnittstelle. 2) Ändere den Entwurf so, daß nur einer der beiden "Cola" knöpfe jeweils benutzt werden kann, falls mindestens eine Cola im Automaten ist.
ru: Модель слева - это интерфейс "Автомата газировки". Если переключиться в режим симуляции и запустить её, появится окно, показывающее внешний и внутренний вид модели автомата. Вы можете помещать монеты и банкноты в соответствующие приёмники, нажимать кнопки выбора напитков и рычаг возврата монет. Эти действия пошлют сигналы Вашей схеме. Выходы интерфейсной схемы могут использоваться для зажигания индикаторов, выдачи напитков и сдачи. Задача: 1) Разработать контроллер, использующий данный интерфейс для управления автоматом. 2) Измените схему так, чтобы любая из кнопок "Coke" могла быть использована, если есть хотя бы один напиток "Coke".

source: These dip switches specify the addresses for the tty status and data registers.
de: Diese DIP Schalter legen die Adressen für den TTY Status und die Datenregister fest.
ru: Эти два DIP-переключателя определяют адреса регистров данных и состояния для терминала.

source: This block decodes insructions producing a map index, register numbers, a function code and a condition code.
de: Dieser Block decodiert Befehle, erstellt einen Index, Register Zahlen, Funktions- code und Condition Code.
ru: Этот блок декодирует инструкции, вычисляя индексы, номера регистров, функциональный и условный коды.

source: This circuit is a simple flip-flop composed of two CMOS NOR gates implemented at the transistor level.
de: Diese Schaltung ist ein einfaches Flipflop, das aus zwei CMOS NOR Gattern auf Transistorebene konstruiert ist.
ru: Эта схема представляет собой простую RS защёлку, состоящую из КМОП вентилей НЕ-ИЛИ, реализованную на уровне транзисторов.

source: This circuit is a simple microprocessor. A simulation script will cause it to start executing the "Animals" game as soon as you start simulation mode. Click on the various logic blocks and press the '>' key to look at the sub-circuits inside. You can return to the parent module by pressing the '&lt;' key. While in simulation mode, click on a wire to see its current value, or double-click to set a trace. Click on the links below to view the contents of supporting files for this circuit: <a href="menagerie.gm">* Microcode/Macrocode Definitions</a> <a href="menagerie.mem">* Memory Initialization File</a> <a href="menagerie.vs">* Simulator Script</a> <a href="menagerie.map">* Symbol Map</a>
de: Die Schaltung implementiert einen einfachen Mikroprozessor. Ein Simulationsskript startetn sofort das Spiel "Animals", wenn man in den Simulationsmodus geht. Klicke auf die unter- schiedlichen Logikblöcke und drücke die '>'- Taste um die Innenschaltungen zu sehen. Zum Elternmodul kommt man durch Drücken der '&lt;' Taste zurück. Während des Simu- lationsmodus kann man auf Leitungen klicken, um die aktuellen Werte zu sehen oder man setzt sie mit einem Doppelklick. Klicke auf die Links unten, um die Inhalte der unterstützenden Dateien für diese Schaltung zu sehen: <a href="menagerie.gm">* Mikrocode/Makrocode Definitionen</a> <a href="menagerie.mem">* Initialisierungsdatei für den Hauptspeicher</a> <a href="menagerie.vs">* Simulatorskript</a> <a href="menagerie.map">* Symboltabelle</a>
ru: Данная схема содержит несложный процессор. Симуляционный скрипт заставляет его исполнять игру "Животные", как только Вы активируете режим симуляции. Выбирайте различные модули и нажимайте '&gt;' чтобы рассмотреть вложенные схемы. Вы можете вернуться к родительскому модулю, нажав клавишу '&lt;'. Во время симуляции щёлкните по проводнику, чтобы увидеть текущее значение сигнала или установите зонд двойным щелчком, чтобы добавить график к логическому анализатору. Ниже приведены ссылки на файлы поддержки данной схемы: <a href="menagerie.gm">* Определения микрокода и макрокода</a> <a href="menagerie.mem">* Файл инициализации памяти</a> <a href="menagerie.vs">* Скрипт симуляции</a> <a href="menagerie.map">* Карта символов</a>

source: This circuit is a simple three-bit adder. Start the simualtor by pressing the "play" button from the button bar. Then, set probes by double clicking on the S0, S1, S2 and C3 wires (and any additional wires you wish to probe). Press the "play" button again to enter continuous simulation mode. In this mode, whenever you change a switch value (by clicking on it), the simulator will simulate until all values have stabalized. End the simulation by pressing the "stop" button on the button bar.
de: Ein einfacher 3-Bit-Addierer. Starte den Simulator durch Drücken des "Abspielen" Knopfes aus der Knopfleiste. Setze dann Tastköpfe durch Doppelklick auf die Leitungen S0, S1, S2 and C3 (und beliebige zusätzliche Leitungen, die getastet werden sollen). Drücke wieder den "Abspielen" Knopf um in den kontinuierlichen Simulationsmodus einzutreten. Immer, wenn sich ein Schalterwert ändert (durch Klicken) simuliert der Simulator so lange, bis sich alle Werte stabilisiert haben. Beende die Simulation durch Drücken des "stop" Knopfes auf der Knopfleiste.
ru: Эта схема содержит простой 3-х битный сумматор. Запустите симулятор, нажав кнопку "пуск" на панели инструментов. Затем установите зонды, дважды щёлкнув по проводам S0, S1, S2 и C3 (а также на любые провода, сигналы которых желаете фиксировать). Снова нажмите "пуск" чтобы перейти в режим непрерывной симуляции. В данном режиме, как только вы изменяете значение переключателя (щёлкая по нему), симулятор производит обработку событий до тех пор, пока значения не стабилизируются. Для завершения симуляции нажмите кнопку "стоп" на панели.

source: This is a frame
ru: Это рамка

source: This is a trival example of an instruction unit. The mpc register contains the micro-instruction program counter, and the two registers on the data out of ROMs m1 and m2 are the current micro- instructions. Note that since these are two separate registers the a single cycle jump delay.
de: Hier ist ein einfaches Beispiel einer Befehlseinheit. Das mpc Register enthält den Mikrobefehlszähler und die beiden Register ans den Datenausgängen der ROM m1 und m2 sind die aktuellen Mikrobefehle Da dies zwei getrennte Register sind, gibt es eine Sprungverzögerung von einem Taktzyklus.
ru: Это тривиальный пример блока инструкций. Регистр mpc - это программный счётчик микроопераций, а два регистра на выходах ПЗУ m1 и m2 - это текущая микрооперация. Заметьте, что поскольку это два различных регистра, существует задержка в один цикл.

source: This is data line. Datas read and write into MDR register (Memory data register).
ru: Это линия данных. Данные читаются и записываются в регистр MDR (Memory data register).

source: This is the definition for module "bar". Ports A, B and C are inputs, and ports X, Y and Z are outputs. Try adding an additional output port "W" from the output of the XOR gate below. Right click at the position you want to create the port then select <font color=red2>Make &rarr; Module &rarr; Module Output</font> from the popup menu. Enter "W" for the net name in the dialog box.
de: Dies ist die Definiton für das Modul "bar". Ports A, B und C sind Eingänge und Ports X, Y und Z sind Ausgänge. Versuche, einen zusätzlichen Ausgangsport "W" aus dem Ausgang des XOR Gatters unten zu erzeugen. Durch Rechtsklick an der Position, wo der Port erzeugt werden soll, und Anwahl von <font color=red2>Bausteine &rarr; Module &rarr; Modulausgang</font> aus dem Popup Menu. Gib als Netznamen "W" in die Dialog box ein.
ru: Это определение модуля "bar". Порты A, B и C являются входами, а X, Y и Z выходами. Попробуйте добавить дополнительный выход "W" к выходу вентиля ИСКЛ-ИЛИ внизу. Щёлкните правой кнопкой мыши на место будущего порта, затем выберите <font color=red2>Компоненты &rarr; Модуль &rarr; Выход модуля</font> из контекстного меню. Введите "W" в качестве имени сети в соответствующее поле.

source: This is the definition for module "foo".
de: Dies ist die Definition des Moduls "foo".
ru: Это определение для модуля "foo".

source: This is the high half of the microinstruction memory.
de: Dies ist die obere Hälfte des Mikrobefehlspeichers.
ru: Это верхняя часть памяти микрокода.

source: This is the low half of the microinstruction memory.
de: Dies ist die untere Hälfte des Mikrobefehlsspeichers.
ru: Это нижняя часть памяти микрокода.

source: This is the memory address line. The address can be selected from the MAR (Memory Address Register) or from the PC (Program Counter).
de: Eine Adressleitung zum Hauptspeicher. Die Adresse kann im MAR (Memory Address Register) oder im PC (Program Counter) ausgewählt werden.
ru: Это линия адресов памяти. Адрес может быть выбран из регистра MAR (Memory Address Register) или из программного счётчика PC (Program Counter).

source: This is the tty. When simulation mode starts, a tty window will be popped up corresponding to this device. The device may be accessed through the simulated CPU by reading or writing the addresses indicated by the dip switches TTYSTATUS and TTYDATA.
de: Dies ist das TTY-Gerät. Im Simulationsmodus geht ein tty-Fenster auf, das diesem Gerät entspricht. Auf das Gerät kann durch die simulierte CPU zugegriffen werden, indem an Adressen gelesen oder geschrieben wird, die durch die DIP-Schalter TTYSTATUS und TTYDATA eingestellt sind.
ru: Это терминал. Когда начинается симуляция, всплывает окно терминала, связанное с этим устройством. К устройству можно получить доступ из эмулируемого процессора, читая и записывая данные по адресам, установленным DIP-переключателями TTYSTATUS и TTYDATA.

source: This is the reset switch.
de: Dies ist der Resetschalter.
ru: Это переключатель сброса.

source: This is the system clock.
de: Dies ist der Systemtakt.
ru: Это генератор синхросигнала.

source: TTY Control
de: TTY Steuerung
ru: Управление терминалом (TTY)

source: Tutorial page
ru: Страница Учебного руководства

source: Unanchored Gate
de: Nicht verankertes Gatter
ru: Свободный вентиль

source: Using Modules
ru: Использование модулей

source: Welcome to TkGate Page
de: Willkommen zu TkGate
ru: Страница Добро пожаловать в TkGate
