Repository: glixx/tkgate
Catalog: locale/*/manuals_*.po
Languages: de, ru

source: 1) Begin the simulation by clicking on the "Play" button or by selecting "Begin Simulation" from the "Simulate" menu. Set Probes on the "S", "R", "Q" and "_Q" signals by double-clicking them. The "_Q" signal is the "Q" with an overline.
de: 1) Starte die Simulation durch Klicken auf den "Abspielen" Knopf oder durch Auswahl von "Beginn Simulation" aus dem "Simulieren" Menu. Setze Tastköpfe auf die "S", "R", "Q" und "_Q" Signale (durch Doppelklick auf sie). Das "_Q" Signal ist das negierte "Q" mit einem Überstrich.
ru: 1) Начните симуляцию, нажав на кнопку "пуск" или выбрав пункт меню "Симуляция" -> "Начать симуляцию". Установите зонды на сигналах "S", "R", "Q" and "_Q", дважды щёлкнув по ним. Сигнал "_Q" - это "Q" с пометкой.

source: 2) Place a probe on the clock line by double-clicking on it.
de: 2) Setze per Doppelklick einen Tastkopf auf die Taktleitung.
ru: 2) Установите зонд на проводник, дважды щёлкнув на нём.

source: 2) Press the space bar 10 to 20 times to advance the simulator. Note that both the "Q" and "_Q" signals are in the unknown state. Now turn on the "S" switch (by clicking on it) and press the space bar another 10 to 20 times. The "Q" signal will go high and the "_Q" signal will go low.
de: 2) Drücke die Leertaste 10 bis 20 mal um den Simulator vorzurücken. Beachte, daß beide Signale, "Q" und "_Q", im unbekannten Zustand sind. Schalte jetzt "S" ein (durch Draufklicken) und drücke die Leertaste weitere 10 bis 20 Male Das "Q" Signal wird auf high gehen und das "_Q" Signal auf low.
ru: 2) Нажимайте пробел 10-20 раз чтобы двигать симуляцию. Обратите внимание, что выходные сигналы имеют неопределённое значение. Теперь включите переключатель "S", щёлкнув по нему и снова нажимайте пробел. Выходные сигналы изменятся (Q=1; _Q=0).

source: 2) To create a new textual verilog modules, press <img src="blk_new.gif"> and set the type to HDL.
de: 2) Um ein neues Verilog-Quelltextmodul zu erzeugen, drücke <img src="blk_new.gif"> und setze den Typ auf HDL.
ru: 2) Чтобы создать новые текстовые модули Verilog нажмите <img src="blk_new.gif"> и установите тип "HDL".

source: 3) Place a probe on the register output by double-clicking on it.
de: 3) Setze einen Tastkopf auf den Registerausgang durch Doppelklick.
ru: 3) Установите зонд на выходе регистра двойным щелчком.

source: 3) Return the "S" switch to the off position and press the space bar 10 to 20 times. The "Q" and "_Q" signals will remain constant.
de: 3) Stelle den Schalter "S" wieder auf die "off" Position und drücke die Leertaste 10 bis 20 mal. Die Signale "Q" und "_Q" bleiben bestehen.
ru: 3) Верните переключатель "S" в положение 0 и снова нажимайте пробел 10-20 раз. Значения "Q" и "_Q" не изменятся.

source: 4) Now turn the "R" switch off by clicking on it and press the space bar 10 to 20 times. The "_Q" signal will go high and the "Q" signal will go low.
de: 4) Schalter durch Klicken den "R" Schalter aus und drücke die Leertaste 10 bis 20 mal. Das "_Q" Signal wird high und das "Q" Signal geht auf low.
ru: 4) Теперь переключите "R" в положение 1 и снова продолжите симуляцию. Сигнал "_Q" станет равным 1, а "Q" = 0.

source: 4) Set the dip switch to 1 by clicking on it, entering a "1" in the dialog box that appears and pressing "Apply".
de: 4) Setze den DIP Schalter auf 1 (draufklicken, Eingeben einer "1" in die Dialogbox die sich öffnet) und drücke "Anwenden".
ru: 4) Установите переключатель в 1, дважды щёлкнув на нём и введя "1" в появившемся диалоговом окне, после чего нажмите "Применить".

source: 5) Make sure the clear line CLR is off to clear the register.
de: 5) Stelle sicher, daß die Clear Leitung CLR "off" ist, um das Register zurückzusetzen.
ru: 5) Убедитесь, что переключатель CLR в положении "0" для очистки регистра.

source: 5) Return the "R" switch to the off position and press the space bar 10 to 20 times. The "Q" and "_Q" signals will remain constant.
de: 5) Lege den "R" Schalter in die off Position und drücke die Leertaste 10 bis 20 mal. Die "Q" und "_Q" Signale werden gleich bleiben.
ru: 5) Переключите "R" в 0, продолжайте симуляцию, чтобы убедиться в неизменности выходных сигналов.

source: 6) Make sure the enable line EN is off
de: 6) Stelle sicher, daß die Enable-Leitung EN auf "off" steht
ru: 6) Убедитесь, что линия EN выключена

source: 7) Now hit a tab to advance one clock cycle. Since the clear line is asserted low, the register will be cleared. Next set the clear line to "on" and continue pressing the "tab" key. Observe the value of the register counting up with each clock cycle.
de: 7) Drücke die Tab-Taste, um einen Takt vorzurücken. Die Clear-Leitung ist nun gesetzt, das Register wird zurückgesetzt. Setze nun die Clear Leitung auf "on" und fahre fort, die "Tab"-Taste zu drücken. Beobachte, wie der Registerwert mit jeder Taktperiode hochzählt.
ru: 7) Теперь нажмите Tab для продвижения на один цикл синхросигнала. Поскольку линия очистки сброшена в 0, то регистр очистится. Далее установите линию очитки в 1 и продолжите, нажав клавишу "Tab" Наблюдайте увеличение значения счётчика каждый такт.

source: 8-Bit Counter Example 1) Start simulation by typing "Ctl-S b"
de: 8-Bit Zähler 1) Starte die Simulation durch Eingabe von "Ctl-S b" auf der Tastatur
ru: Пример 8-разрядного счётчика 1) Начните симуляцию нажатием "Ctl-S b"

source: 8-Bit Counter
ru: 8-ми разрядный счётчик

source: Address Resolution
de: Addressauflösung
ru: Разрешение адреса

source: Advanced Editing Methods
ru: Расширенные методы редактирования

source: <a href="ex2/flipflop.v"><img src="example_flipflop.gif"> <h3>4-Bit Counter</h3></a> A 4-bitcounter implemented using four single-bit D-flip-flops.
de: <a href="ex2/flipflop.v"><img src="example_flipflop.gif"> <h3>4-Bit Zähler</h3></a> Ein 4-Bit-Zähler, der mit 4 einzelnen D-Flipflops implementert ist.
ru: <a href="ex2/flipflop.v"><img src="example_flipflop.gif"> <h3>4-разрядный счётчик</h3></a> 4-разрядный счётчик, реализованный с использованием четырёх одноразрядных D-защёлок.

source: <a href="ex3/counter.v"><img src="example_counter.gif"> <h3>8-Bit Counter</h3></a> A counter implemented using the register and adder devices.
de: <a href="ex3/counter.v"><img src="example_counter.gif"> <h3>8-Bit Zähler</h3></a> Ein Zähler, der mit Register- und Addierer-Bausteinen entworfen ist.
ru: <a href="ex3/counter.v"><img src="example_counter.gif"> <h3>8-разрядный счётчик</h3></a> Счётчик, реализованный с использованием регистра и сумматора.

source: <a href="ex4/trff.v"><img src="example_trff.gif"> <h3>Transistor-Level FF</h3></a> A flop-flop implemented using nmos and pmos devices.
de: <a href="ex4/trff.v"><img src="example_trff.gif"> <h3>Transistor-Level Flipflop</h3></a> Ein Flipflop, implementiert mit NMOS and PMOS Transistoren.
ru: <a href="ex4/trff.v"><img src="example_trff.gif"> <h3>Защёлка на уровне транзисторов</h3></a> Триггер, реализованный с использованием Н-МОП и П-МОП элементов.

source: <a href="ex7/stdlogic.v"><img src="example_counter.gif"> <h3>Microcircuits 74xx</h3></a> A few examples of circuits using the standard 74 series logic circuit library.
ru: <a href="ex7/stdlogic.v"><img src="example_counter.gif"> <h3>Микросхемы 74xx</h3></a> Несколько примеров схем с использованием библиотеки микросхем стандартной логики серии 74.

source: <a href="../index.v">[BACK]</a>
de: <a href="../index.v">[ZURÜCK]</a>
ru: <a href="../index.v">[НАЗАД]</a>

source: <a href="menagerie.v">[BACK]</a>
de: <a href="menagerie.v">[ZURÜCK]</a>
ru: <a href="menagerie.v">[НАЗАД]</a>

source: <a href="#/PAGE6">&lang;BACK TO TUTORIAL&rang;</a>
ru: <a href="#/PAGE6">&lang;ВОЗВРАТ К РУКОВОДСТВУ&rang;</a>

source: <a href="#/PAGE8">&lang;BACK TO TUTORIAL&rang;</a>
de: <a href="#/PAGE8">&lang;Zurück zum Tutorium&rang;</a>
ru: <a href="#/PAGE8">&lang;ВОЗВРАТ К РУКОВОДСТВУ&rang;</a>

source: <a href="welcome.v">Go back to the TkGate main page.</a>
de: <a href="welcome.v">Zurück zur Hauptseite von TkGate.</a>
ru: <a href="welcome.v">Вернуться к стартовой схеме TkGate.</a>

source: A module is an encapsulated piece of logic that can be made to serve a purpose in a circuit, similar to a function call in a program. Each module in TkGate has an "interface" and a "definition": * The <i color=green4>interface</i> describes the external appearance of a module including the size of the box and the positions of the ports on it. TkGate supports "block" interfaces and "symbol" interfaces. * The <i color=green4>definition</i> describes the internal logic that the module implements. TkGate supports "netlist" and "HDL" modules.
de: Ein Modul ist ein gekapselte Stück Schaltungslogik, das in einer größeren Schaltung eine bestimmte Aufgabe erfüllt, ganz ähnlich wie ein Modul oder eine Klasse in einem Programm. Jedes Modul in TkGate hat eine "Schnittstelle" und eine "Definition": * Die <i color=green4>Schnittstelle</i> beschreibt die äußere Erscheinung eines Moduls einschließlich der Größe der Box und der Positionen der Ports auf ihr. TkGate unterstützt "block" Schnittstellen und "symbolische" Schnittstellen. * Die <i color=green4>Definition</i> beschreibt die interne, durch das Modul implementierte Logik. TkGate unterstützt "Netzlisten" und "HDL" Module.
ru: Модуль - это инкапсулированный логический блок, являющийся элементом иерархической структуры схемы. Модуль выполняет определённую функцию, может быть переиспользован и в определенном смысле похож на класс в объектно-ориентированном программировании. Каждый модуль в TkGate имеет "интерфейс" и "определение": * <i color=green4>Интерфейс</i> определяет внешнее представление модуля ("чёрный ящик"): имена и разрядность портов, размеры ограничивающего прямоугольника или специфический графический символ модуля, расположение портов на нём и др. * <i color=green4>Определение</i> описывает внутреннюю логику модуля. TkGate поддерживает модули, описанные в виде графических логических схем и описаний на языке Verilog.

source: Anchored Gate
de: Verankertes Gatter
ru: Привязанный вентиль

source: AND Gate Circuit
de: AND-Gatterschaltung
ru: Схема с вентилем И

source: AND gate
de: AND Gatter
ru: Вентиль И

source: Arithmetic (M=0) <b>A</b> <b>A</b> OR <b>B</b> <b>A</b> OR NOT <b>B</b> (<b>A</b> OR <b>B</b>)+(<b>A</b> AND NOT <b>B</b>) <b>A</b> - <b>B</b> - 1 <b>A</b> + <b>B</b> <b>A</b> AND <b>B</b> - 1 <b>A</b> OR <b>B</b>
ru: Арифметические (M=0) <b>A</b> <b>A</b> ИЛИ <b>B</b> <b>A</b> ИЛИ НЕ <b>B</b> (<b>A</b> ИЛИ <b>B</b>)+(<b>A</b> И НЕ <b>B</b>) <b>A</b> - <b>B</b> - 1 <b>A</b> + <b>B</b> <b>A</b> И <b>B</b> - 1 <b>A</b> ИЛИ <b>B</b>

source: <b>Simulator Script Example:</b> <font face=courier> initial begin $display("%t: Start of script",$time); $tkg$probe(ck, reg_out, clr); $display("%t: Set probes",$time); clr = 1'b0; #200; clr = 1'b1; $display("%t: Done with reset",$time); #500; $stop(); end </font>
de: <b>Simulator Skript Beispiel:</b> <font face=courier> initial begin $display("%t: Start des Skripts",$time); $tkg$probe(ck, reg_out, clr); $display("%t: Tastkoepfe setzen",$time); clr = 1'b0; #200; clr = 1'b1; $display("%t: Ende mit Reset",$time); #500; $stop(); end </font>
ru: <b>Пример скрипта симуляции:</b> <font face=courier> initial begin $display("%t: Запуск скрипта",$time); $tkg$probe(ck, reg_out, clr); $display("%t: Установка зондов",$time); clr = 1'b0; #200; clr = 1'b1; $display("%t: Завершено со сбросом",$time); #500; $stop(); end </font>

source: Circuit highlights: <a href="#memory.tty0">* TTY Device</a> <a href="#iunit.mpc">* Micro Program Counter</a> <a href="#eunit.alu">* ALU</a> <a href="#memory.m1">* Main Memory</a> <a href="#memory.PC">* Program Counter</a>
de: Highlights der Schaltung: <a href="#memory.tty0">* TTY Baustein</a> <a href="#iunit.mpc">* Microprogrammzähler</a> <a href="#eunit.alu">* ALU</a> <a href="#memory.m1">* Hauptspeicher</a> <a href="#memory.PC">* Programmzähler</a>
ru: Важные части схемы: <a href="#memory.tty0">* Терминал</a> <a href="#iunit.mpc">* Микропрограммный счётчик</a> <a href="#eunit.alu">* АЛУ</a> <a href="#memory.m1">* Основная память</a> <a href="#memory.PC">* Программный счётчик</a>

source: Combinational Simulation
ru: Комбинационная симуляция

source: Condition Code Handling
de: Condition Code Behandlung
ru: Управление условными кодами

source: Creating a Circuit
ru: Создание схемы

source: Customizing TkGate
ru: Настройка TkGate

source: Editing Gates
ru: Редактирование вентилей

source: Editing Wires
ru: Редактирование проводников

source: Flip-flop at the transistor level
ru: Защёлка на уровне транзисторов

source: <font color=green4>Hint: An alternate way to add or remove an anchor on a gate is to right click and change the anchor flag in the popup menu.</font>
de: <font color=green4>Hinweis: ein alternativer Weg, einen Anker eines Gatters zu setzen oder zu löschen ist ein Rechtsklick und ein Wechsel des Anker- Flags im Popup Menu.</font>
ru: <font color=green4>Подсказка: Альтернативный способ изменить привязку вентиля заключается в использовании флага в контекстном меню.</font>

source: <font color=green4>Hint: Click in a blank area to unselect a group.
de: <font color=green4>Hinweis: Klicke in eine Freifläche, wenn eine Gruppe wieder deselektiert werden soll.
ru: <font color=green4>Подсказка: Щёлкните по пустому месту, чтобы убрать групповое выделение.

source: <font color=green4>Hint: Hitting the <font color=red2>Delete</font> key will delete all of the selected gates without copying it to the clipboard.</font>
de: <font color=green4>Hinweis: Durch Drücken der <font color=red2>Entf</font> Taste können alle ausgewählten Gatter gelöscht werden, ohne sie in die Zwischenablage zu kopieren.</font>
ru: <font color=green4>Подсказка: Нажатие клавиши <font color=red2>Delete</font> удалит все выделенные вентили без перемещения их в буфер обмена.</font>

source: <font color=green4>Hint: If a selection contains any anchored gates, the entire selection will act as if it were anchored.</font>
de: <font color=green4>Hinweis: Enthält eine Auswahl irgendwelche verankerten Gatter, so verhält sich die gesamte Auswahl, als wäre sie verankert.</font>
ru: <font color=green4>Подсказка: Если выделение содержит привязанные вентили, то всё выделение поведёт себя как привязанное.</font>

source: <font color=green4>Hint: If you are unable to modify a module interface, right click on it, select <img src=i_modprops.gif></font><font color=red2>Module Properties...</font><font color=green4>, then unset the interface protection options in the dialog box.</font>
de: <font color=green4>Hinweis: Falls die Änderung einer Modulschnittstelle nicht gelingt, klicke rechts auf sie und wähle <img src=i_modprops.gif></font><font color=red2>Moduleigenschaften...</font><font color=green4> und setze dann die Schutzeigenschaften der Schnittstelle in der aufkommenden Dialogbox.</font>
ru: <font color=green4>Подсказка: Если Вы не можете изменить интерфейс модуля, то щёлкните по нему правой кнопкой мыши, выберите <img src=i_modprops.gif></font><font color=red2>Свойства модуля...</font><font color=green4>, и снимите флаги защиты интерфейса.</font>

source: <font color=green4>Hint: If you opened this module by choosing <img src=blk_open.gif><font color=red2>Open</font> from the menu or toolbar, you can close it by right clicking in the canvas area and selecting <font color=red2>Close</font>.
de: <font color=green4>Hinweis: Falls dieses Modul durch Anwahl von <img src=blk_open.gif><font color=red2>Öffnen</font> aus Menu oder Toolbar geöffnet wurde, kann es durch einen Rechtsklick in das Editierfeld und die Anwahl von <font color=red2>Schließen</font> geschlossen werden.
ru: <font color=green4>Подсказка: если вы открыли этот модуль, выбрав <img src=blk_open.gif><font color=red2>Открыть</font> в меню или на панели инструментов, вы можете закрыть его, щёлкнув правой кнопкой мыши в области холста и выбрав <font color=red2>Закрыть</font>.

source: <font color=green4>Hint: In addition to using probes, you can also see the value of a net by clicking and holding the mouse button down for a few seconds.</font>
de: <font color=green4>Hinweis: Zusätzlich kann man den aktuellen Wert einer Leitung sehen wenn man klickt und die Maustaste einige Sekunden gedrückt hält.</font>
ru: <font color=green4>Подсказка: В дополнение к использованию зондов Вы можете также узнать значение сигнала, щёлкнув по проводнику мышью и удерживая кнопку несколько секунд.</font>

source: <font color=green4>Hint: In addition to using the scroll bar on the logic analyzer, you can click and drag in the main window to fine tune the the position of the traces.</font>
de: <font color=green4>Hinweis: Zusätzlich zum Scrollbar im Logikanalysator kann man auch im Hauptfenster durch Klicken und Ziehen die Position der Signale feinabstimmen.</font>
ru: <font color=green4>Подсказка: В дополнение к использованию полос прокрутки можно перемещать саму область окна анализатора для позиционирования трассировки.</font>

source: <font color=green4>Hint: Joints are formed any time the soldering iron is active and you release the wire in the middle of another wire.</font>
de: <font color=green4>Hinweis: Verbindungen werden immer dann erzeugt, wenn der Lötkolben aktiv ist und die Leitung in der Mitte einer anderen Leitung fallengelassen wird.</font>
ru: <font color=green4>Подсказка: Всякий раз, когда активен инструмент "Паяльник" и Вы отпускаете конец провода посередине другого, создаётся соединение.</font>

source: <font color=green4>Hint: Many properties are gate- specific. Try opening the property boxes of different gate types to see what proprties can be modified.</font>
de: <font color=green4>Hinweis: Viele Eigenschaften sind gatter- spezifisch. Öffne die Eigenschaftsboxen unterschiedlicher Gattertypen, um zu sehen, welche Eigenschaften geändert werden können.</font>
ru: <font color=green4>Подсказка: Многие свойства являются специфическими для конкретных вентилей. Попробуйте открыть диалоги свойств для различных типов вентилей, чтобы увидеть отличия.</font>

source: <font color=green4>Hint: Normally, TkGate will simulate combinational circuits until all signals have reached a steady state. You can hit the space bar to advance the simulator by one time unit.</font>
de: <font color=green4>Hinweis: Normalerweise simuliert TkGate Schaltnetze, bis alle Signale einen stabilen Zustand erreicht haben. Der Simulator schreitet um eine Zeiteinheit fort, wenn die Leertaste gedrückt wird.</font>
ru: <font color=green4>Подсказка: Обычно TkGate будет производить симуляцию последовательных схем до тех пор, пока все сигналы не перестанут изменяться. Вы можете нажать пробел, чтобы продвинуть симуляцию на одну единицу времени.</font>

source: <font color=green4>Hint: Remember, to start and unpause the simulator press the "<img src="simstart.gif"> <font color=red2>Simulate</font>" tab followed by the <img src=sim_go.gif> button.
de: <font color=green4>Hinweis, zur Erinnerung: Start und Rückkehr aus der Pause geht durch Drücken der "<img src="simstart.gif"> <font color=red2>Simulieren</font>" Taste, gefolgt vom <img src=sim_go.gif> Knopf.
ru: <font color=green4>Подсказка: Помните: чтобы запустить и обновить симулятор, перейдите на вкладку "<img src="simstart.gif"> <font color=red2>Симуляция</font>" и нажмите кнопку <img src=sim_go.gif>.

source: <font color=green4>Hint: The pages in this tutorial are actually modules with the names PAGE1, PAGE2, etc.</font>
de: <font color=green4>Hinweis: Die Seiten dieses Tutoriums sind in Wirklichkeit Module mit den Namen PAGE1, PAGE2, etc.</font>
ru: <font color=green4>Подсказка: Страницы данного руководства на самом деле являются модулями с названиями PAGE1, PAGE2 и т.д.</font>

source: <font color=green4>Hint: The search tool will look in all modules of your circuit for the target string. Try searching for a gate named "hari".</font>
de: <font color=green4>Hinweis: Das Suchwerkzeug schaut in allen Modulen der Schaltung nach dem Suchstring. Suche nach einem Gatter namens "hari".</font>
ru: <font color=green4>Подсказка: Инструмент поиска ищет во всех модулях текущей схемы. Попробуйте найти вентиль с названием "hari".</font>

source: <font color=green4>Hint: The soldering iron cursor will show you when you have selected a connectable wire end.</font>
de: <font color=green4>Hinweis: Der Lötkolben-Cursor zeigt an, wenn ein verbindbares Drahtende ausgewählt ist.</font>
ru: <font color=green4>Подсказка: Когда Вы выбираете конец проводника, который можно соединить с другим, отображается курсор в виде паяльника.</font>

source: <font color=green4>Hint: You can also drag and drop module instance from the tree view, but it is easier to use the list view since that view gives you a straight alphabetical list of all module.</font>
de: <font color=green4>Hinweis: Man kann auch eine Modulinstanz aus der Baumansicht ziehen und plazieren, es ist aber leichter mit der Listenansicht, weil es da eine alphabetische Sicht auf alle Module gibt.</font>
ru: <font color=green4>Подсказка: Можно перетаскивать модули в область редактирования и в режиме дерева модулей. В зависимости от сложности схемы может оказаться удобнее найти нужный модуль в иерархии дерева схемы или в полном алфавитном списке модулей.</font>

source: <font color=green4>Hint: You can also navigate to modules by right clicking and select <font color=red2>Open</font> from the popup menu.
de: <font color=green4>Hinweis: Um zu den Modulen zu gelangen kann man auch Rechtsklicken und <font color=red2>Öffnen</font> aus dem Popup Menu aufrufen.
ru: <font color=green4>Подсказка: Переходить между модулями можно щёлкнув правой кнопкой мыши и выбрав пункт <font color=red2>Открыть</font> из контекстного меню.

source: <font color=green4>Hint: You can also use the <img src="rotation0.gif" bgcolor=gray> button to set the default orientation for newly created gates.</font>
de: <font color=green4>Hinweis: Genauso gut kann man den <img src="rotation0.gif" bgcolor=gray> Knopf drücken, um die Standard- orientierung für neue erzeugte Gatter festzulegen.</font>
ru: <font color=green4>Подсказка: Вы можете использовать кнопку <img src="rotation0.gif" bgcolor=gray> для установки ориентации по умолчанию для вновь создаваемых вентилей.</font>

source: <font color=green4>Hint: You can also use the keyboard shortcut. Select the position by left clicking then use "a" to create an AND gate.</font>
de: <font color=green4>Hinweis: Genauso gut ist ein Tastendruck. Wähle die Position mit Linksklick und tippe "a", um ein AND Gatter zu erzeugen.</font>
ru: <font color=green4>Подсказка: Вы также можете использовать клавиатурные комбинации. Выберите позицию щелчком левой кнопки мыши и нажмите "a" для создания вентиля <b>И</b>.</font>

source: <font color=green4>Hint: You can also use the keyboard shortcut. Select the position by left clicking then use "o" to create an OR gate.</font>
de: <font color=green4>Hinweis: Genauso gut ist ein Tastendruck. Wähle die Position mit Linksklick und tippe "o", um ein OR Gatter zu erzeugen.</font>
ru: <font color=green4>Подсказка: Вы также можете использовать клавиатурные комбинации. Выберите позицию щелчком левой кнопки мыши и нажмите "o" для создания вентиля <b>ИЛИ</b>.</font>

source: <font color=green4>Hint: You can also use the keyboard shortcut. Select the position by left clicking then use "s" to create a switch.</font>
de: <font color=green4>Hinweis: Genauso gut ist ein Tastendruck. Wähle die Position mit Linksklick und tippe "s", um einen Schalter zu erzeugen.</font>
ru: <font color=green4>Подсказка: Вы также можете использовать клавиатурные комбинации. Выберите позицию щелчком левой кнопкой и нажмите "s" для создания переключателя.</font>
