Repository: glixx/tkgate
Catalog: locale/*/manuals_*.po
Languages: de, ru

source: <font color=green4>Hint: You can disable the automatic cleanup features in wire editing by holding the Alt key while moving wires.</font>
de: <font color=green4>Hinweis: Die automatische Bereinigung beim Editieren von Leitungen kann durch Halten der Alt Taste während der Bewegung verhindert werden.</font>
ru: <font color=green4>Подсказка: Вы можете отключить средства автоматической подчистки при редактировании проводников, удерживая клавишу <b>Alt</b> во время перемещения проводника или его фрагмента.</font>

source: <font color=green4>Module Tree View Example</font>
de: <font color=green4>Beispiel einer Modulbaumansicht</font>
ru: <font color=green4>Пример иерархического представления модуля</font>

source: <font size=5><a href="@T/welcome.v">Go back to the TkGate main page</a></font>
de: <font size=5><a href="@T/welcome.v">Zurück zur TkGate Hauptseite</a></font>
ru: <font size=5><a href="@T/welcome.v">Вернуться на главную страницу</a></font>

source: gates without extender bars
de: Gatter ohne Erweiterungsbalken
ru: вентили без расши- рительных панелей

source: gates with extender bars
de: Gatter mit Erweiterungsbalken
ru: вентили с расшири- тельными панелями

source: Group Editing Features
ru: Средства редактирования групп

source: <h1 color=green4>Welcome to TkGate <value-of name="tkgate-version"></h1> <value-of name="tkgate-copyright"> TKGate comes with ABSOLUTELY NO WARRANTY; see 'Help...License' menu for license and warranty details. Report problems to <a href="mailto:starling13@gmail.com"><value-of name="tkgate-mailcontact"></a> [released <value-of name="tkgate-release-date">] <h3>Click on a link below to start using tkgate!</h3> <a href="file:///@T/index.v">* Go to the tutorial</a> <a href="file:///@E/index.v">* Go to the example circuits</a> <a href="action:newFile">* Edit a new circuit</a> <a href="file:///@H/doc/en/index.html">* Open the documentation </a>
de: <h1 color=green4>Willkommen bei TkGate <value-of name="tkgate-version"></h1> <value-of name="tkgate-copyright"> TKGate kommt mit KEINERLEI GARANTIE; siehe dazu auch im Menu 'Hilfe...Lizenz' die Lizenz- und Garantiedetails. Fehlerberichte bitte an <a href="mailto:starling13@gmail.com"><value-of name="tkgate-mailcontact"></a> senden [freigegeben <value-of name="tkgate-release-date">] <h3>Zum Ausprobieren von TkGate auf einen der Links unten klicken!</h3> <a href="file:///@T/index.v">* Zum Tutorial</a> <a href="file:///@E/index.v">* Zu den Beispielschaltungen</a> <a href="action:newFile">* Editieren einer neuen Schaltung</a> <a href="file:///@H/doc/en/index.html">* Öffnen der Dokumentation </a>
ru: <h1 color=green4>Добро пожаловать в TkGate <value-of name="tkgate-version"></h1> <value-of name="tkgate-copyright"> TKGate предоставляется БЕЗ ВСЯКИХ ГАРАНТИЙ; см. пункт меню <b>Справка&rarr; Лицензионное соглашение</b> для получения дополнительной информации о лицензии и гарантиях. Сообщайте о проблемах на <a href="mailto:starling13@gmail.com"><value-of name="tkgate-mailcontact"></a> [выпуск от <value-of name="tkgate-release-date">] <h3>Перейдите по одной из ссылок чтобы начать использовать TkGate!</h3> <a href="file:///@T/index.v">* Перейти к учебному руководству</a> <a href="file:///@E/index.v">* Перейти к примерам схем</a> <a href="action:newFile">* Редактировать новую схему</a> <a href="file:///@H/doc/en/index.html">* Просмотр документации</a>

source: <h1 color=red>Coke Machine Problem</h1>
de: <h1 color=red>Cola-Automat: Aufgabe</h1>
ru: <h1 color=red>Задача автомата по продаже газировки</h1>

source: <h1>Tutorial Chapters:</h1> <h3><a href="create.v">1. Creating a Circuit</a></h3> - Get started by creating a simple circuit. <h3><a href="gates.v">2. Editing Gates</a></h3> - The basics of editing gates. <h3><a href="wires.v">3. Editing Wires</a></h3> - The basics of editing wires. <h3><a href="group.v">4. Group Editing Features</a></h3> - Operate on groups of gates. <h3><a href="modules.v">5. Using Modules</a></h3> - Using modules in your circuit. <h3><a href="advanced.v">6. Advanced Editing Techniques</a></h3> - Learn advanced editing tricks. <h3><a href="combinational1.v">7. Combinational Simulation</a></h3> - Simulate a circuit with combinational logic. <h3><a href="sequential1.v">8. Sequential Simulation</a></h3> - Simulate a circuit with sequential logic. <h3><a href="verilog.v">9. Textual Verilog</a></h3> - Create modules with textual Verilog descriptions. <h3><a href="options.v">10. Customizing TkGate</a></h3> - Customize TkGate to suit your tastes.
de: <h1>Lernabschnitte:</h1> <h3><a href="create.v">1. Erzeugen einer Schaltung</a></h3> <h3><a href="gates.v">2. Gatter editieren</a></h3> - Grundlagen zum Konfigurieren von Gattern. <h3><a href="wires.v">3. Leitungen editieren</a></h3> - Grundlagen zum Konfigurieren von Leitungen. <h3><a href="group.v">4. Editieren von Gattergruppen</a></h3> - Bearbeiten von Gruppen benachbarter Gatter. <h3><a href="modules.v">5. Benutzung von Modulen</a></h3> - Verwenden von Modulkapselung in der Schaltung. <h3><a href="advanced.v">6. Fortgeschrittene Editiertechniken</a></h3> - Einige weniger gebräuchliche Editiertricks. <h3><a href="combinational1.v">7. Simulation von Schaltnetzen</a></h3> - Simulieren eines Schaltnetzes. <h3><a href="sequential1.v">8. Simulation von Schaltwerken</a></h3> - Simulation sequentieller Schaltungen. <h3><a href="verilog.v">9. Schaltungen mit Verilog-Text</a></h3> - Erzeugen von Modulen, die textuelle Verilog-Beschreibungen enthalten. <h3><a href="options.v">10. Anpassen von TkGate</a></h3> - Konfigurieren nach eigenem Geschmack.
ru: <h1>Разделы руководства:</h1> <h3><a href="create.v">1. Создание схемы</a></h3> - Начните с создания простой схемы. <h3><a href="gates.v">2. Редактирование вентилей</a></h3> - Основы редактирования вентилей. <h3><a href="wires.v">3. Редактирование проводов</a></h3> - Основы редактирования проводов. <h3><a href="group.v">4. Средства редактирования групп</a></h3> - Управляйте группами вентилей. <h3><a href="modules.v">5. Использование модулей</a></h3> - Использование моделей в ваших схемах. <h3><a href="advanced.v">6. Расширенные техники редактирования</a></h3> - Изучите особенности и тонкости редактирования схем. <h3><a href="combinational1.v">7. Комбинационная симуляция</a></h3> - Имитируйте работу схемы с комбинационной логикой. <h3><a href="sequential1.v">8. Последовательная симуляция</a></h3> - Имитируйте работу схемы с последовательной логикой. <h3><a href="verilog.v">9. Текстовый Verilog</a></h3> - Создавайте модули с текстовым описанием на Verilog. <h3><a href="options.v">10. Настройка TkGate</a></h3> - Настраивайте TkGate по своему вкусу.

source: <h2>This is a comment</h2> <p>It uses <b>html</b> markup.</p>
ru: <h2>Это комментарий</h2> <p>Он использует <b>html</b> разметку.</p>

source: <h3>Advanced Editing Techniques</h3> In this chapter you will learn some additional techniques to be more efficient at editing circuits in TkGate.
de: <h3>Fortgeschrittene Editiertechniken</h3> In diesem Abschnitt lernen wir weitere Techniken, um noch effizienter Schaltungen in TkGate editieren zu können.
ru: <h3>Расширенные техники редактирования</h3> В данном разделе рассматриваются дополнительные техники редактирования, которые позволяют сделать работу с TkGate более эффективной.

source: <h3><a href="ex1/combinational.v"><img src="example_combinational.gif"> Combinational Logic</a></h3> A simple 3-bit adder that you simulate. Push the play button then click on the switches and watch how the LEDs change.
de: <h3><a href="ex1/combinational.v"><img src="example_combinational.gif"> Schaltnetz</a></h3> Ein einfacher 3-Bit Addierer. Drücke den Abspielknopf und Klicke auf die Schalter und beobachte, wie sich die LEDs ändern.
ru: <h3><a href="ex1/combinational.v"><img src="example_combinational.gif"> Комбинационная логика</a></h3> Простой 3-разрядный сумматор, который можно запускать в симуляторе. Нажмите кнопку запуска, затем изменяйте значения переключателей и смотрите, как меняются состояния светодиодов.

source: <h3><a href="ex5/menagerie.v"><img src="example_menagerie.gif"> Menagerie CPU</a></h3> A simple microcode-based CPU that will play the "Animals" game on a TTY device when simulated.
de: <h3><a href="ex5/menagerie.v"><img src="example_menagerie.gif"> Menagerie CPU</a></h3> Eine einfache, Microcode-basierte CPU die das "Animals" Spiel auf einem TTY Baustein bei der Simulation ausführt.
ru: <h3><a href="ex5/menagerie.v"><img src="example_menagerie.gif"> Компьютер "Зверинец"</a></h3> Простой микропроцессор с микрокодом, который выполняет игру "Животные" во время симуляции.

source: <h3><a href="ex6/coke.v"><img src=example_coke.gif> Coke Machine</a></h3> This example uses TkGate's Viritual Peripheral Device (VPD) mechanism to create an interactive "Coke Machine" that can be controlled by a user circuit. Only the coke machine device itself is included. Can you build a controller for it?
de: <h3><a href="ex6/coke.v"><img src=example_coke.gif> Cola-Automat</a></h3> Dieses Beispiel nutzt TkGate's Virtual Peripheral Devices (VPD) um einen inter- aktiven "Cola-Automaten" zu erzeugen, der durch eine Benutzerschaltung gesteuert werden kann. Nur das Gerät selbst ist enthalten. Kannst Du eine Steuerung dafür entwerfen?
ru: <h3><a href="ex6/coke.v"><img src=example_coke.gif> Автомат газировки</a></h3> Этот пример использует механизм виртуальных периферийных устройств (ВПУ) TkGate для создания интерактивной модели "Автомат газировки", которой можно управлять с помощью пользовательской схемы. Включена только модель. Сможете ли Вы построить контроллер для неё?

source: <h3>Combinational Circuit Simulation</h3> <b>(dip switches)</b> To change the value of a dip while simulating a circuit, first click on it to open a value dialog box. Then enter the new value in hexidecimal and click <font color=red2>Apply</font>. Start the simulator then try changing the input values in the four-bit adder below and observe the output.
de: <h3>Simulation von Schaltnetzen</h3> <b>(DIP Schalter)</b> Um während der Simulation einer Schaltung den Wert eines DIP Schalters zu ändern, klickt man zuerst auf ihn, um die Werte-Dialogbox zu öffnen. Dann gibt man den neuen Wert hexadezimal an und klickt <font color=red2>Anwenden</font>. Starte den Simulator und versuche dann, die Eingangswerte für den 4-Bit-Addierer unten zu ändern und beobachte die Ausgabe.
ru: <h3>Симуляция комбинационных схем</h3> <b>(DIP-переключатели)</b> Чтобы изменить значение DIP-переключателя во время симуляции щёлкните по нему для открытия диалога ввода. Введите новое значение в 16-ричной форме и нажмите <font color=red2>Применить</font>. Запустите симулятор и попробуйте изменить значения переключателей в этой схеме.

source: <h3>Combinational Circuit Simulation</h3> <b>(setting probes)</b> Press the "<img src="simstart.gif"> <font color=red2>Simulate</font>" tab again, to enter simulation mode. This time right click on a wire (e.g., the one labeled "S") and slect "Add/Delete Probe" from the popup menu. The will set a probe on that wire and bring up the logic analyzer window. Set probes on some more wires, then unpause the simulator by pressing <img src=sim_go.gif bgcolor=gray>. Click on the switches to change their state and observe how the logic analyzer is updated.
de: <h3>Simulation von Schaltnetzen</h3> <b>(Setzen von Tastköpfen)</b> Drücke erneut die "<img src="simstart.gif"> <font color=red2>Simulieren</font>" Taste zum Eintritt in den Simulationsmodus. Klicke diesmal auf eine Leitung, (z.B. die mit "S" bezeichnete) und wähle "Tastkopf hinzufügen/löschen" aus dem Popup Menu. Damit wird ein Tastkopf auf diese Leitung gesetzt und ein Logikanalysatorfenster öffnet sich. Setze auf einige andere Leitung ebenfalls Tastköpfe und löse den Simulator durch Druck auf den <img src=sim_go.gif bgcolor=gray> Knopf aus dem Pause-Zustand. Klicke auf die Schalter, um ihre Zustände zu ändern und beobachte, wie sich die Ausgabe im Logikanalysator ändert.
ru: <h3>Симуляция комбинационных схем</h3> <b>(установка зондов)</b> Снова перейдите на вкладку "<img src="simstart.gif"> <font color=red2>Симуляция</font>". Щёлкните правой кнопкой мыши по проводнику, обозначенному "S" и выберите "Добавить/Удалить зонд" из контекстного меню. На проводник будет установлен зонд и откроется окно логического анализатора. Установите зонды ещё на несколько проводников и запустите симулятор кнопкой <img src=sim_go.gif bgcolor=gray>. Пощёлкайте переключателями, чтобы увидеть как изменение значений сигналов отображается в окне логического анализатора.

source: <h3>Combinational Circuit Simulation</h3> <b>(starting the simulator)</b> Press the "<img src="simstart.gif" bgcolor=gray> <font color=red2>Simulate</font>" tab above the main canvas to enter simulation mode. When you first enter simulation mode, the simulator will be paused as indicated by the depressed <img src=sim_pause.gif bgcolor=gray> button on the simulator tool bar. Press the <img src="sim_go.gif" bgcolor=gray> button to begin simulation. Now try clicking on the switches to change their state and observe how the LEDs change. When you are done, stop the simulator by pressing <img src=sim_stop.gif bgcolor=gray> and go on to the next page.
de: <h3>Simulation von Schaltnetzen</h3> <b>(Starten des Simulators)</b> Drücke die "<img src="simstart.gif" bgcolor=gray> <font color=red2>Simulieren</font>" Taste oberhalb der Hauptarbeitsfläche, um in die Simulation zu gelangen. Beim ersten Eintritt in den Simulationsmodus ist der Simulator im Pause-Zustand. Das wird durch den gedrückten <img src=sim_pause.gif bgcolor=gray> Knopf in der Simulations-Toolbar angezeigt. Drücke den <img src="sim_go.gif" bgcolor=gray> Knopf zum Start der Simulation. Versuche nun, durch Klicken auf die Schalter die Schalterzustände zu ändern und beobachte, wie die LEDs sich ändern. Der Simulator wird durch Druck auf den <img src=sim_stop.gif bgcolor=gray> Knopf gestoppt, wenn Du fertig bist. Gehe dann zur nächsten Seite.
ru: <h3>Симуляция комбинационных схем</h3> <b>(запуск симулятора)</b> Выберите вкладку "<img src="simstart.gif" bgcolor=gray> <font color=red2>Симуляция</font>" над областью редактирования чтобы войти в режим симуляции. Сразу после этого симулятор будет в состоянии приостановки, о чем свидетельствует утопленная кнопка <img src=sim_pause.gif bgcolor=gray> на панели инструментов. Нажмите кнопку <img src="sim_go.gif" bgcolor=gray> чтобы начать симуляцию. Теперь пощёлкайте переключателями и наблюдайте изменение состояния светодиодов. Когда наиграетесь, остановите симулятор, нажав кнопку <img src=sim_stop.gif bgcolor=gray>, и переходите к следующему разделу.

source: <h3>Combinational Circuit Simulation</h3> <b>(the instance hierarchy)</b> While the simulator is active, the hierarchical module list displays the hierarchy by instance rather than by module. This is because the state (i.e., net values) for each instance of a module in the hierarcy may be different. Invoke and unpause the simulation for the circuit below, then try examining the nets in different instances of the ADD1 module. Double click on "g0&lt;ADD1>", "g1&lt;ADD1>", etc. in the the hierarchical list box to go to each instance.
de: <h3>Simulation von Schaltnetzen</h3> <b>(Instanzhierarchie)</b> Während der Simulator aktiv ist, zeigt die hierarchische Modulliste die Hierarchie der Instanzen anstelle der Module an. Denn der Zustand (die Netzeigenschaften) jeder Instanz eines Moduls in der Hierarchie können verschieden sein. Rufe die simulation der untenstehenden Schaltung auf und entlasse sie aus der Pause. Untersuche dann die Netze in verschiedenen Instanzen des ADD1-Moduls. Klicke jedesmal doppelt auf "g0&lt;ADD1>","g1&lt;ADD1>", etc. in der Hierarchielisten-Box, um zu jeder Instanz zu gelangen.
ru: <h3>Симуляция комбинационных схем</h3> <b>(иерархия экземпляров)</b> В режиме симуляции иерархический список модулей отображает иерархию экземпляров, а не модулей. Это происходит потому, что состояние (напр. значение сигналов) для разных экземпляров одного модуля может отличаться. Запустите симуляцию и просмотрите состояние сетей в различных экземплярах модуля ADD1. Дважды щёлкните "g0&lt;ADD1>", "g1&lt;ADD1>" и т.д. в иерархическом списке чтобы перейти к каждому экземпляру.

source: <h3>Combinational Circuit Simulation</h3> TkGate uses a Verilog-based discrete event simulator to simulate your circuit description. In this chapter the basics needed to simulate a combinational circuit will be presented.
de: <h3>Simulation von Schaltnetzen</h3> TkGate benutzt einen Verilog-basierten diskret-ereignisgesteuerten Simulator zur Simulation der Schaltungsbeschreibung. In diesem Abschnitt werden die Grundlagen beschrieben, die zur Simulation von Schaltnetzen benötigt werden.
ru: <h3>Симуляция комбинационных схем</h3> TkGate использует основанный на <b>Verilog</b> дискретно-событийный симулятор для моделирования описания схемы. В данном разделе описаны основы имитации комбинационных схем.

source: <h3>Creating a Simple Circuit</h3> Finally, connect the wires. Begin by grabbing the end of the wire leading from one of the switches with the left mouse button and drag it to the upper input terminal of the AND gate.
de: <h3>Erzeugen einer einfachen Schaltung</h3> Verbinde schließlich die Leitungen. Fasse ein Schalter-Drahtende mit der linken Maustaste und ziehe es zum oberen Eingang des AND Gatters.
ru: <h3>Создание простой схемы</h3> Наконец, соедините элементы проводниками. Начните с того, что захватите конец провода, идущего из верхнего переключателя левой кнопкой мыши и, удерживая левую кнопку, перетащите его к концу провода, ведущего к верхнему входу верхнего вентиля И, после чего отпустите левую кнопку мыши.

source: <h3>Creating a Simple Circuit</h3> In this chapter, we will walk through the steps of creating the simple circuit shown below.
de: <h3>Erzeugen einer einfachen Schaltung</h3> In diesem Abschnitt zeigen wir schrittweise, wie die einfache Schaltung unten erzeugt wird.
ru: <h3>Создание простой схемы</h3> В этом разделе вы выполните шаги для построения простой схемы, приведённой ниже.

source: <h3>Creating a Simple Circuit</h3> Next create two switches. Right click in each of the two dashed line box then select <font color=red2>Make &rarr; I/O &rarr; Switch</font> from the popup menu.
de: <h3>Erzeugen einer einfachen Schaltung</h3> Erzuge als nächstes zwei Schalter. Klicke rechts in jede der strichlierten Boxen und wähle <font color=red2>Bausteine &rarr; I/O &rarr; Schalter</font> aus dem Popup Menu.
ru: <h3>Создание простой схемы</h3> Далее создайте два переключателя. Последовательно щёлкните правой кнопкой мыши в пунктирных рамках и выберите <font color=red2>Компоненты &rarr; Ввод-вывод &rarr; Переключатель</font> из контекстного меню.

source: <h3>Creating a Simple Circuit</h3> Now create an OR gate. Right click in the dashed line box then select <font color=red2>Make &rarr; Gate &rarr; OR</font> from the popup menu.
de: <h3>Erzeugen einer einfachen Schaltung</h3> Erzeuge nun ein OR Gatter. Klicke mit der rechten Maustaste in die strichlierte Box und wähle <font color=red2>Bausteine &rarr; Gatter &rarr; OR</font> aus dem Popup Menu.
ru: <h3>Создание простой схемы</h3> Теперь создайте вентиль ИЛИ. Щёлкните правой кнопкой внутри пунктирной рамки и выберите <font color=red2>Компоненты &rarr; Вентиль &rarr; ИЛИ</font> из контекстного меню.

source: <h3>Creating a Simple Circuit</h3> Now make the final connection. Grab the lower input terminal of the AND gate and drag it down near the wire between the lower switch and the OR gate. Release the wire to create a joint.
de: <h3>Erzeugen einer einfachen Schaltung</h3> Erzeuge nun die letzte Verbindung. Fasse den unteren Eingang des AND Gatters und ziehe ihn in die Nähe des Drahtes zwischen dem unteren Schalter und dem OR Gatter. Lasse den Draht los, dann entsteht eine Lötverbindung.
ru: <h3>Создание простой схемы</h3> Теперь создадим последние соединения. Захватите конец нижнего входа верхнего вентиля И, перетащите его и отпустите посередине провода, соединяющего нижний переключатель и нижний вентиль И, чтобы создать соединение.

source: <h3>Creating a Simple Circuit</h3> Start by creating an AND gate. Right click in the dashed line box then select <font color=red2>Make &rarr; Gate &rarr; AND</font> from the popup menu.
de: <h3>Erzeugen einer einfachen Schaltung</h3> Beginne mit der Erzeugung eines AND Gatters. Klicke mit rechts in die strichlierte Box und wähle <font color=red2>Bausteine &rarr; Gatter &rarr; AND</font> aus dem Popup Menu.
ru: <h3>Создание простой схемы</h3> Начните с создания вентиля И. Щёлкните правой кнопкой по пунктирному прямоугольнику и выберите <font color=red2>Компоненты &rarr; Вентиль &rarr; И</font> из контекстного меню.

source: <h3>Customizing TkGate</h3> <b>(setting your key beinding style)</b> You can the basic key-binding style that you would like to use on the <font color=red2>Interface</font> tab of the options dialog box. Currently you can choose between "emacs"-style and "Windows"-style. Chosing one of these options will make key bindings for operations such as cut/paste similar to either emacs or Windows, although key bindings for gate creation operations will remain the same.
de: <h3>Anpassen von TkGate</h3> <b>(Setzen der Tastaturbindungen)</b> Man kann die Tastaturbindungen für die Benutzung der <font color=red2>Schnittstelle</font> Taste der Optionen-Dialogbox anpassen. Zur Zeit kann man zwischen "emacs"-style und "Windows"-Stil wählen. Das paßt die Tastaturbelegungen für Operationen wie Ausschneiden/Einfügen an die Gepflogenheiten von emacs oder Windows an. Die Tastenbelegungen für die Erzeugung von Gattern bleiben allerdings erhalten.
ru: <h3>Настройка TkGate</h3> <b>(изменение стиля назначения клавиш)</b> Вы можете изменять стиль привязки клавиш в группе "Интерфейс" диалога настроек. В настоящее время можно выбирать между стилями "emacs" и "Windows". Выбор стиля привязки сделает вызов таких операций как копирование/вставка аналогичными Windows или Emacs. Однако, операции работы с вентилями будут использовать одни и те же клавиши.

source: <h3>Customizing TkGate</h3> <b>(setting your personal identification)</b> To set your TkGate options, open the options dilaog box by selecting <font color=red2>File &rarr; Options</font> from the main menu. Enter your site name and user name in the "Identity" dialog box. The values you enter here will be used on any printed output from TkGate.
de: <h3>Anpassen von TkGate</h3> <b>(Angabe der persönlichen Daten)</b> Zum Festlegen der TkGate Optionen öffnet man die Optionen Dialogbox durch Auswahl von <font color=red2>Datei &rarr; Optionen</font> aus dem Hauptmenu. Gib den Namen der Institution und den Benutzernamen in der "Organisation" Dialogbox ein. Die eingegebenen Werte werden in jeder Druckausgabe von TkGate-Schaltungen benutzt.
ru: <h3>Настрока TkGate</h3> <b>(Установка персональной идентификации)</b> Для установки настроек TkGate, откройте диалог настроек, выбрав <font color=red2>Инструменты &rarr; Настройки</font> из меню. Введите имя компьютера и Ваше собственное в разделе "Общие". Введённые значения будут использованы при печати из TkGate.

source: <h3>Customizing TkGate</h3> This chapter introduces some of the options that can be customized in TkGate. Your option settings are stored in a file named ".tkgate2-preferences" in your home directory.
de: <h3>Anpassen von TkGate</h3> Dieser Abschnitt führt einige der Optionen ein, mit denen TkGate angepaßt werden kann. Die Definitionen der Optionen werden in einer Datei namens ".tkgate2-preferences" im Heimatverzeichnis gespeichert.
ru: <h3>Настройка TkGate</h3> Этот раздел описывает некоторые настройки TkGate. Ваши настройки хранятся в файле ".tkgate2-preferences" в Вашем домашнем каталоге.
