Repository: glixx/tkgate
Catalog: locale/*/manuals_*.po
Languages: de, ru

source: <h3>Sequential Simulation</h3> <b>(continuous simulation)</b> Also like with a combinational circuit, you can press the <img src=sim_go.gif bgcolor=gray> button to unpause and simulate continously. Try it with the circuit below. This circuit contains a "real-world-time" oscilator that will cycle once per second. Like in the previous example, you will need to reset it by turning the "reset" switch off monentarily.
de: <h3>Simulation von Schaltwerken</h3> <b>(Kontinuierliche Simulation)</b> Genau wie beim Schaltnetz kann auch hier der <img src=sim_go.gif bgcolor=gray> Knopf gedrückt werden, um aus der Pause zurückzukehren und kontinuierlich zu simulieren. Versuche das mit der untenstehenden Schaltung. Sie enthält einen "Realzeit"-Oszillator, der eine Periode pro Sekunde ausführt. Wie im vorigen Beispiel ist das kurzzeitige Ausschalten des "reset" Schalters erforderlich.
ru: <h3>Симуляция поледовательных схем</h3> <b>(непрерывная симуляция)</b> Как и в случае комбинационной симуляции, Вы можете нажать кнопку <img src=sim_go.gif bgcolor=gray> для запуска непрерывной симуляции. Попробуйте на схеме снизу. Эта схема содержит осциллятор реального времени, настроенный на период в одну секунду. Как и в предыдущем примере, необходимо сбросить счётчик, переведя переключатель <b>reset</b> в положение <b>off</b>, а затем в положение <b>on</b>.

source: <h3>Sequential Simulation</h3> <b>(scripts)</b> In addition to interactive simulator control, you can also write a simulator script. Simulator script files have the extension ".vs" and are written using Verilog syntax. While the simulator is active, press <img src=sim_script.gif bgcolor=gray> to load a simulator script file. You can use a script file to set and remove probes, advance the simulation time, set signal values and display messages in the TkGate log (<img src=log.gif bgcolor=gray>) window. See the TkGate documentation for details on how to write simulator scripts.
de: <h3>Simulation von Schaltwerken</h3> <b>(Skripte)</b> Neben interaktiver Simulatorsteuerung können auch Simulatorskripte geschrieben werden. Simulator-Skriptdateien haben die Endung ".vs" und werden in Verilog-Syntax geschrieben. Drücke bei aktivem Simulator <img src=sim_script.gif bgcolor=gray>, um die Skriptdatei in den Simulator zu laden. Man kann eine Skriptdatei benutzen, um Tastköpfe zu setzen und zu löschen, die Simulationszeit vorrücken zu lassen, Signalwerte zu setzen und Meldungen im TkGate log (<img src=log.gif bgcolor=gray>) Fenster anzuzeigen. Details zum Schreiben von Simulatorskipten sehe man in der TkGate Dokumentation nach.
ru: <h3>Симуляция последовательных схем</h3> <b>(скрипты)</b> В дополнение к управлению симулятором посредством интерфейса, Вы также можете написать скрипт симуляции. Файлы скриптов симуляции имеют расширение ".vs" и написаны на <b>Verilog</b>. В режиме симуляции нажмите кнопку <img src=sim_script.gif bgcolor=gray> для загрузки скрипта симуляции. Скрипт можно использовать для добавления и удаления зондов, управления временем в симуляции, устанавливать значения сигналов и помещать сообщения в область сообщений TkGate (<img src=log.gif bgcolor=gray>). Обратитесь к документации TkGate за информацией о написании скриптов симуляции.

source: <h3>Sequential Simulation</h3> <b>(stepped simulation)</b> Start the simulator by pressing the "<img src="simstart.gif"> <font color=red2>Simulate</a>" tab just as with a combinational circuit. Next, set probes on the "ck" and "reg_out" signals by right clicking and selecting <font color=red2>Add/Delete</font> probe. Now advance the simulator by a several "clock steps" by pressing the <img src=sim_clock.gif> button or by pressing the <font color=red2>Tab</font> key. Notice that the "reg_out" single show an unknown value of "x". In order to reset it and start the counter you, must first set the "reset" switch to "off", advance the simulator by a clock step, then return the "reset" switch to the "on" position.
de: <h3>Simulation von Schaltwerken</h3> <b>(Schrittweise Simulation)</b> Starte den Simulator duch Drücken der "<img src="simstart.gif"> <font color=red2>Simulieren</a>" Taste, genauso wie bei einem Schaltnetz. Setze dann Tastköpfe auf die "ck" und "reg_out" Signale durch Rechtsklicken und Auswahl von <font color=red2>Hinzufügen/Löschen</font> Tastkopf. Schreite nun im Simulator durch mehrere "Taktschritte" fort, indem Du den <img src=sim_clock.gif> Knopf oder die <font color=red2>Tab</font> Taste drückst. Beachte, daß das "reg_out" Signal einen unbekannten "x"-Wert zeigt. Um es zurückzusetzen und den Zähler neu zu starten, muß erst der "reset" Schalter auf "off" gesetzt werden. Rücke den Simulator um einen Taktschritt vor und stelle dann den "reset" Schalter auf die "on" Position zurück.
ru: <h3>Симуляция последовательных схем</h3> <b>(пошаговая симуляция)</b> Запустите симулятор, перейдя на вкладку "<img src="simstart.gif"> <font color=red2>Симуляция</a>". После этого установите зонды на сигналы <b>ck</b> и <b>reg_out</b>, щёлкнув на соответствующих проводниках правой кнопкой мыши и выбрав пункт <font color=red2>Добавить/удалить зонд</font>. Теперь продвиньте симуляцию на несколько шагов синхронизации, нажимая кнопку <img src=sim_clock.gif> или клавишу <font color=red2>Tab</font>. Заметьте, что сигнал <b>reg_out</b> имеет неопределённое значение <b>x</b>. Чтобы сбросить его и начать считать синхроимпульсы переведите переключатель <b>reset</b> в положение <b>off</b>, продолжите симуляцию на один шаг и верните переключатель <b>reset</b> в положение <b>on</b>.

source: <h3>Sequential Simulation</h3> This chapter builds on the previous chapter about simulating combinational circuits and introduces simulator features that are useful for simulating sequential circuits.
de: <h3>Simulation von Schaltwerken</h3> Dieser Abschnitt baut auf dem vorigen über die Simulation von Schaltnetzen auf. Er führt Simulatorelemente ein, die für die Simulation von Schaltwerken nützlich sind.
ru: <h3>Симуляция последовательной логики</h3> В целом аналогичная симуляции комбинационных схем, симуляция последовательных имеет ряд особенностей, которым и посвящён данный раздел.

source: <h3>Textual Verilog</h3> 1) Right click on the module below and select <font color=blue>Open</blue>.
de: <h3>Textbasiertes Verilog</h3> 1) Klicke rechts auf das Modul unten und wähle <font color=blue>Öffnen</blue>.
ru: <h3>Текстовый Verilog</h3> 1) Щёлкните правой кнопкой мыши по модулю снизу и выберите <font color=blue>Открыть</blue>.

source: <h3>Textual Verilog</h3> The TkGate simulator is based on the Verilog hardware description language. As such, any modules you design using the graphical editor are translated into Verilog before being simulated. You can also write modules directly in Verilog. Note that this chapter is not designed to teach Verilog, but rather to teach how to include Verilog modules in TkGate.
de: <h3>Textuelle Beschreibung mit Verilog </h3> Der TkGate Simulator basiert auf der Hardwarebeschreibungssprache Verilog. Jedes Modul, das mit dem graphischen Editor entworfen wird, wird vor der Simulation in Verilog-Programmtext übersetzt. Man kann Module auch direkt in Verilog schreiben. Allerdings kann dieser Abschnitt nicht dazu dienen, die Sprache Verilog zu lehren. Vielmehr soll erläutert werden, wie man Verilog-Module in TkGate einbindet.
ru: <h3>Текстовый Verilog</h3> Симулятор TkGate основан на языке описания аппаратуры Verilog. Таким образом, модули, которые Вы создаете в графическом редакторе схем, преобразуются в Verilog для сохранения и симуляции. Можно создавать модули непосредственно используя Verilog. Этот короткий раздел не предназначен для обучения Verilog. Здесь рассмотрен вопрос включения текста на Verilog в схемы TkGate.

source: <h3>Using Modules</h3> <b>(automatic interface generation)</b> The interface of a module includes the size and shape of the box as well as the location and names of the ports. The easiest way to create an interface is to use automatic generation. Automatic generation uses the ports referenced in the definition to create the interface. To automatically create an interface for the "bar" module, first click on the module list tab <img src=modlist.gif bgcolor=gray>, then right click on "bar" and select <font color=red2>Interface &rarr; Auto Generate...</font> Now left click and drag the bar module onto the canvas to see the new interface.
de: <h3>Module benutzen</h3> <b>(Automatische Schnittstellenerzeugung)</b> Die Schnittstelle eines Moduls enthält Größe und Form der Box und Ort und Namen der Ports: Am einfachsten ist es, die Schnittstelle automatisch generieren zu lassen. Automatische Erzeugung nutzt die in der Definition festgelegten Ports zur Generierung der Schnittstelle. Klicke auf den Modullisten-Tab <img src=modlist.gif bgcolor=gray>, um automatisch eine Schnittstelle für das "bar" Modul zu erzeugen. Klicke mit rechts auf "bar" und wähle <font color=red2>Schnittstelle&rarr; Automatisch erzeugen...</font>. Dann ziehe mit einem Linksklick das "bar" Modul auf die Planfläche, um die neue Schnittstelle zu sehen.
ru: <h3>Использование модулей</h3> <b>(автоматическая генерация интерфейса)</b> Интерфейс модуля описывает форму и размер символа, а также расположение и состав портов. Простейший способ создания интерфейса - автоматическая генерация. При этом используется описание портов из определения модуля. Для того, чтобы создать интерфейс модуля "bar", выберите вкладку "Интерфейс" в области редактирования и выберите <font color=red2>Интерфейс &rarr; ...</font>. Теперь перетащите модуль в область редактирования для создания экземпляра и просмотра созданного интерфейса.

source: <h3>Using Modules</h3> <b>(creating module definitions)</b> To create a new module, press the <img src=blk_new.gif> button. Enter the name for the new module and select whether you wish to create it as a "netlist" (graphical) module or an HDL (textual) module. Try creating a new module named "CPU".
de: <h3>Module benutzen</h3> <b>(Moduldefinitionen erzeugen)</b> Zum Erzeugen eines neuen Moduls drückt man den <img src=blk_new.gif> Knopf. Gib den Namen für das neue Modul ein und wähle, ob es ein graphisches Netzlistenmodul oder ein textuelles HDL Modul werden soll. Versuche, ein neues Modul namens "CPU" zu erzeugen.
ru: <h3>Использование модулей</h3> <b>(создание определений модулей)</b> Для создания нового модуля нажмите кнопку <img src=blk_new.gif>. Введите имя нового модуля и выберите, хотите ли Вы создать модуль, описанный как графическая логическая схема, или на языке описания аппаратуры. Попробуйте создать новый модуль "CPU".

source: <h3>Using Modules</h3> <b>(creating module instances)</b> The easiest way to create a module instance is to find its name in the module list and drag it into the current circuit. Try switching to the list view by pressing <img src=modlist.gif> then dragging several instances of the "bar" module into the current edit window.
de: <h3>Module benutzen</h3> <b>(Modulinstanzen erzeugen)</b> Am leichtesten läßt sich eine Modulinstanz erzeugen, wenn man den Modulnamen in der Modulliste findet und ihn in die aktuelle Schaltung hineinzieht. Versuche, durch Umschalten mit <img src=modlist.gif> auf die Listenansicht einzustellen und ziehe mehere Instanzen des "bar" Moduls ins aktuelle Editierfenster.
ru: <h3>Использование модулей</h3> <b>(создание экземпляров модулей)</b> Простейший способ создать экземпляр модуля - это найти его в списке доступных модулей и перетащить в область схемы. Переключитесь в режим списка модулей, выбрав вкладку <img src=modlist.gif> в правой части окна TkGate, затем перетащите модуль "bar" в область редактирования для создания нескольких экземпляров.

source: <h3>Using Modules</h3> <b>(editing module definitions)</b> To edit the definition of a module you have created, double click on its name in the module name tree or list view. Alternatively you can right click on an instance of the module and select <font color=red2>Open</font> from the popup menu.
de: <h3>Module benutzen</h3> <b>(Editieren von Moduldefinitionen)</b> Ein Doppelklick auf den Namen eines selbsterzeugten Moduls in der Modulbaum- oder Modullistenansicht ermöglicht das Editieren der Moduldefinition. Alternativ dazu kann man auch auf eine Modulinstanz rechtsklicken und <font color=red2>Öffnen</font> aus dem Popup Menu wählen.
ru: <h3>Использование модулей</h3> <b>(редактирование определений модулей)</b> Для редактирования определения созданного модуля, дважды щёлкните по нему в списке или дереве модулей. Также можно щёлкнуть правой кнопкой мыши по экземпляру модуля и выбрать <font color=red2>Открыть</font> из контекстного меню.

source: <h3>Using Modules</h3> <b>(interface editor)</b> You can directly edit the module interface using TkGate's interface mode. Click on the <img src=editintr.gif> <font color=red2>Interface</font> tab over the main canvas to enter this mode. Details on how to use this mode are given in the TkGate documentation. Click on the <img src=editmode.gif> <font color=red2>Edit</font> tab to return to the normal editing mode.
de: <h3>Module benutzen</h3> <b>(Schnittstelleneditor)</b> Die Modulschnittstelle kann direkt mit TkGate's Schnittstellenmodus editiert werden. Klicke auf das <img src=editintr.gif> <font color=red2>Schnittstelle</font>n Tab über dem dem Haupteditierfeld, um in diesen Modus zu gelangen. Details zu Benutzung dieses Modus stehen in der TkGate Dokumentation. Klicke auf den <img src=editmode.gif> <font color=red2>Edit</font> Tab, um zum normalen Editiermodus zurückzukehren.
ru: <h3>Использование модулей</h3> <b>(редактор интерфейса)</b> Вы можете непосредственно редактировать интерфейс модуля, используя режим "Интерфейс" TkGate. Выберите вкладку <img src=editintr.gif> <font color=red2>Интерфейс</font> над областью редактирования для активации данного режима. Описание работы в этом режиме приведено в документации к TkGate. Выберите вкладку <img src=editmode.gif> <font color=red2>Редактирование</font> чтобы вернуться в обычный режим.

source: <h3>Using Modules</h3> <b>(manual interface generation)</b> You can also manually create and edit the interface of a module: * To change the size of the interface, left-click on an edge or corner and drag it with the mouse. * To add a port, right click on an edge and choose the port type to create from the popup menu. * To delete a port, select the <img src=cut_curs.gif> tool and cut the wire off of the module. * To edit port properties, double click on the port with the <img src=mov_curs.gif> tool.
de: <h3>Module benutzen</h3> <b>(Schnittstellenerzeugung von Hand)</b> Die Schnittstelle eines Moduls kann auch von Hand erzeugt und editiert werden: * Mit Linksklick auf eine Kante oder Ecke und Ziehen wird die Größe der Schnittstelle verändert. * Mit einem Rechtsklick auf eine Kante kann der zu erzeugende Porttyp aus dem Popup Menu gewählt werden. * Um einen Port wieder zu löschen, wählt man das <img src=cut_curs.gif> Werkzeug und schneidet die Leitung am Modul ab. * Mit einem Doppelklick auf einem Port mit dem <img src=mov_curs.gif> Werkzeug können die Porteigenschaften editiert werden.
ru: <h3>Использование модулей</h3> <b>(ручная генерация интерфейса)</b> Интерфейс модуля также можно создавать и редактировать вручную: * Чтобы изменить размер прямоугольника символа элемента, подведите указатель мыши к углу или ребру прямоугольника и перетащите. * Чтобы добавить порт, щёлкните правой кнопкой мыши по ребру и выберите нужный тип порта. * Чтобы удалить порт, выберите инструмент <img src=cut_curs.gif> и отрежьте порт от модуля. * Чтобы редактировать свойства порта, дважды щёлкните по нему инструментом <img src=mov_curs.gif>.

source: <h3>Using Modules</h3> <b>(module list)</b> The set of modules in the current circuit is shown on the left-hand side of the interface. You can choose between a <i>tree view</i> <img src=modtree.gif bgcolor=gray> (see example) and a <i>list view</i> <img src=modlist.gif bgcolor=gray>. The tree view shows the module hierarchy starting at a top-level root module indicated by the <img src=document.gif> symbol. Modules which are still in the circuit, but are not used anywhere in the hierarchy are listed under the "<img src=unused.gif> Unused" branch. Click on <img src=hboxopen.gif> to open a branch on the tree.
de: <h3>Module benutzen</h3> <b>(Modulliste)</b> Die Menge der zur aktuellen Schaltung gehörenden Module wird auf der linken Seite der Schnittstelle gezeigt. Man kann zwischen einer <i>Baumansicht</i> <img src=modtree.gif bgcolor=gray> (siehe Beispiel) und einer <i>Listenansicht</i> <img src=modlist.gif bgcolor=gray> entscheiden. Die Baumansicht zeigt die Modulhierarchie, beginnend mit einem obersten Wurzelmodul, das durch <img src=document.gif> symbolisiert wird. Module, die noch zur Schaltung gehören, aber nirgends mehr in der Hierarchie benutzt werden, sind im "<img src=unused.gif> Unbenutzten" Zweig gelistet. Klicke auf <img src=hboxopen.gif>, um einen Zweig im Baum zu öffnen.
ru: <h3>Использование модулей</h3> <b>(список модулей)</b> Набор модулей, используемых в схеме, отображается в левой части главного окна. Вы можете переключаться между режимами <i>Дерево</i> <img src=modtree.gif bgcolor=gray> (см. пример) и <i>Список</i> <img src=modlist.gif bgcolor=gray>. В древовидном режиме отображается иерархия модулей, начиная с корневого, помеченного символом <img src=document.gif>. Модули, объявленные в схеме, но нигде не использованные отображаются в ветви "<img src=unused.gif> Unused". Нажмите на символ <img src=hboxopen.gif> чтобы раскрыть ветвь дерева.

source: <h3>Using Modules</h3> <b>(module list symbols)</b> The following symbols are used in the module tree and list view:
de: <h3>Module benutzen</h3> <b>(Modullistensymbole)</b> Folgende Symbole werden in der Baum- oder Listenansicht der Module verwendet:
ru: <h3>Использование модулей</h3> <b>(Символы списка модулей)</b> В древовидном представлении модулей и списке используются следующие символы:

source: <h3>Using Modules</h3> <b>(updating the default interface)</b> Module interfaces constructed in <img src=editmode.gif> <font color=red2>Edit</font> mode, apply only to the specific instance that you created. To make an interface the default for newly created instance of modules of that type, right click on an interface and select <font color=red2>Interface &rarr; Set</font>. Try setting the interface to each of the two instances of ALU modules below, then try creating new ALU modules by dragging them from the module list.
de: <h3>Module benutzen</h3> <b>(Standardschnittstellen aktualisieren)</b> Modulschnittstellen, die im <img src=editmode.gif> <font color=red2>Edit</font> Modus erzeugt wurden, gehören nur zur speziellen Instanz, aus der sie geschaffen wurden. Um eine Schnittstelle zur Standardschnittstelle für neu erzeugte Modulinstanzen dieses Typs zu machen, klickt man mit rechts auf eine Schnittstelle und wählt <font color=red2>Schnittstelle &rarr; Setzen</font>. Versuche die Schnittstellen von jeder der beiden Instanzen der ALU Module unten zu setzen. Versuche dann, neue ALU Module durch Ziehen aus der Modulliste zu erzeugen.
ru: <h3>Использование модулей</h3> <b>(обновление интерфейса по умолчанию)</b> Интерфейсы, изменённые в режиме <img src=editmode.gif> <font color=red2>Редактирование</font> используются только одним экземпляром модуля. Чтобы сделать интерфейс используемым по умолчанию всеми вновь создаваемыми экземплярами модуля данного типа, щёлкните правой кнопкой мыши по интерфейсу и выберите <font color=red2>Интерфейс &rarr; Установить по умолчанию</font>. Попробуйте установить по умолчанию интерфейс каждого из приведённых на схеме снизу модулей <b>ALU</b> и посмотрите, как это повлияет на экземпляры, создаваемые перетаскиванием данного модуля из панели слева.

source: <h3>Using Modules</h3> In this chapter, you will learn how to create, edit and manage modules.
de: <h3>Module benutzen</h3> In diesem Abschnitt wird gezeigt, wie man Module erzeugt, editiert und verwaltet.
ru: <h3>Использование модулей</h3> В данном разделе рассматриваются вопросы управления модулями и иерархического проектирования схем.

source: <h3>Wire Editing</h3> <b>(Automatic Loop Deletion)</b> Grab the endpoint of the XOR output wire in the circuit below. Drag it up until it crosses the horizontal segment next to the gate and release it. TkGate will automatically remove the loop.
de: <h3>Leitungen editieren</h3> <b>(Automatische Schleifenerkennung)</b> Fasse das Ende der XOR-Ausgangsleitung in der Schaltung unten an und ziehe es hoch, bis es das horizontale Segment dicht am Gatter kreuzt und lasse los. TkGate wird die Leitungsschleife automatisch beseitigen.
ru: <h3>Расширенные техники редактирования</h3> <b>(Редактирование проводников: автообнаружение петель)</b> Перетаскивайте конец проводника на выходе вентиля <b<ИСКЛ. ИЛИ</b>, пока он не пересечёт горизонтальный фрагмент сразу после вентиля. TkGate автоматически удалит образовавшуюся петлю.

source: <h3>Wire Editing</h3> <b>(Automatic Wire Cleanup)</b> Select the <img src="cut_curs.gif" bgcolor=gray> tool and cut the wire at the position indicated by the arrow in the AND Gate Circuit. TkGate will automatically remove the wire joint. Now cut the wire at the position indicated by the arrow in the OR Gate Circuit. The free wire end is automatically deleted.
de: <h3>Leitungen editieren</h3> <b>(Automatisches Aufräumen von Leitungen)</b> Wähle das <img src="cut_curs.gif" bgcolor=gray> Werkzeug und schneide die Leitung in der AND-Schaltung an der durch den Pfeil bezeichneten Stelle durch. TkGate wird automatisch die Leitungsverbindung lösen. Schneide dann auch in der OR-Schaltung an der durch den Pfeil bezeichneten Stelle die Leitung ab. Das freie Leitungsende wird automatisch gelöscht.
ru: <h3>Расширенные техники редактирования</h3> <b>(Редактирование проводников: автоматическая подчистка)</b> Выберите инструмент <img src="cut_curs.gif" bgcolor=gray> и разрежьте проводник в позиции, отмеченной стрелкой в схеме с вентилями <b>И</b>. TkGate автоматически удалит ненужную точку соединения проводников. Сделайте то же самое в схеме с вентилями <b>ИЛИ</b>. Свободный конец проводника будет автоматически удалён.

source: <h3>Wire Editing</h3> <b>(Gate Alignment)</b> You can align a group of gates by selecting them and then pressing the <img src=edit_valgn.gif bgcolor=gray> to align them vertically, and <img src=edit_halgn.gif bgcolor=gray> to align them horizontally. Try it on the groups of gates below.
de: <h3>Leitungen editieren</h3> <b>(Gatter ausrichten)</b> Eine Gruppe von Gattern kann man durch Auswählen und Drücken von<img src=edit_valgn.gif bgcolor=gray> vertikal ausrichten und mit <img src=edit_halgn.gif bgcolor=gray> horizontal. Versuche das mit der Gruppe von Gattern unten.
ru: <h3>Редактирование проводников</h3> <b>(Выравнивание компонентов)</b> Можно выровнять группу компонентов, выделив их и нажав кнопку <img src=edit_valgn.gif bgcolor=gray> для вертикального выравнивания и <img src=edit_halgn.gif bgcolor=gray> для горизонтального. Потренируйтесь на группах внизу.
